{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/the-real-world-and-the-narrative","id":"0","imgs":"https://cdn.substack.com/image/fetch/w_66,h_66,c_fill,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2c6d7c4d-9177-45a1-9bc3-b9f7d3b4000f_625x623.jpeg","readingtime":98,"text":"We each inhabit two very different worlds simultaneously: the real world, and the narrative world.The real world is the physical world of matter, of atoms and molecules and stars and planets and animals wandering around trying to bite and copulate with each other. Science does not yet understand much of this world, but it can reasonably be said to have some degree of existence to it.The narrative world is made of stories, of mental chatter about what's going on. It is only related to the real world in the loosest of terms, and commonly has no relation to the real world whatsoever.In the narrative world you exist as a person with a certain name and a certain life story with a mountain of adjectives attached to you, some believed consciously and some believed subconsciously. You are this, you are that. You are inadequate. You are inferior. You are clever. You are fat. You are unlovable. Whatever. Words, words, words, words, words.In the real world what you think of as \"you\" exists as an organism, breathing and digesting and pulsing and moving in the appearance of time. No thoughts or words need to occur for this organism to exist; it just is whatever it is.In the narrative world, your surroundings are experienced as friends and foes, good and bad, right and wrong, threatening and non-threatening. Churning, babbling stories about what's happening pervade the experience of the narrative world: those people over there are bad people and should be punished. Those people over there are the good people and they should be rewarded. That man is blah blah blah. That woman is this and that. In the real world, your surroundings are experienced as raw sensory data: sensory impressions arising in each point in spacetime. Breath going in, breath going out. The feeling of feet on the ground. Sound of a bird call. Sight of a passing car. It's all just happening as it is, as whatever it is. Simple. Present.In the narrative world, the United States changed dramatically on the 20th of January. If you live in one narrative echo chamber it changed dramatically for the better, if you live in the other narrative echo chamber it changed dramatically for the worse. But throughout the narrative world most agree that the 20th of January 2021 marked a very real and significant turn of events.In the real world, things are moving in pretty much the same ways they were on January 19th. The money is moving in more or less the same directions at more or less the same rates. The weapons and troops are moving to more or less the same places in basically the same ways as before. The resources are behaving in essentially the same way. The people are moving in pretty much the same way. The actual, physical dynamics have remained predominantly unchanged.The real world and the narrative world could not be more different. Skilled manipulators exploit these differences for their benefit like foreign exchange traders exploit the differences in world currency values. A religious manipulator can get you to hand over your real currency in exchange for narrative currency about eternal salvation or spiritual purification. A sexual predator can manipulate you into trading the real currency of sex for the narrative currency of \"I think I'm in love with you\". A politician can manipulate you into trading the real currency of votes for the narrative currency of whatever they say on the campaign trail.It's very hard to control people in the real world by just using the means that are available in the real world. If you're bigger and stronger than someone you can get them to hand over their sandwich by hitting them, or if you have a big stick or something. If you want to exert a large amount of control over a large number of people, though, you generally have to seize that control through the narrative world.It's easier to control people through the narrative world than the real world because the narrative world and its relationship with the real world is too complicated for most people to understand, whereas the real world is quite simple and straightforward. For this reason, a tremendous amount of energy goes into controlling the dominant narratives, the dominant stories that people tell about what's going on in the world.Convince people to accept the narrative that a government's leader is an evil dictator in need of regime change, and you can trade that narrative for real world control over a crucial geostrategic region. Convince people to accept that the status quo is working fine and any attempts to change it are dangerous insanity, and you ensure that people will never rise up and take away your real world control. Convince people that anyone questioning your narratives is a conspiracy theorist or a Russian propagandist, and you ensure your continued hegemonic control over the narrative world.The most powerful manipulators are the ones who have succeeded in exerting control over both the real world and the narrative world, and they pursue both agendas with equal emphasis. Populations in the real world who insist upon their own national, resource, financial, economic or military sovereignty are subject to real world attacks by bombs, starvation sanctions and special ops. Entities in the narrative world which threaten imperial narrative domination are attacked, smeared, marginalized and censored.That's all we are seeing with the increasingly shrill mainstream panic about disinformation, conspiracy theories, foreign propaganda and domestic extremism. Our rulers and their media lackeys are not compassionately protecting us from deception, they are ensuring that they remain the only ones authorized to administer deception. By golly the only ones allowed to deceive us should be our government, our news media, our teachers and our priests.As China and its allies increasingly threaten the real world hegemony of the US and its allies, operations in the narrative world are getting increasingly heated and intense. Expect continued demonization of Russia, and expect anti-China propaganda to get more and more noisy. Expect people to be herded into partisan echo chambers with thicker and thicker walls in the narrative world, because dividing them up in this way makes it much easier to administer propaganda to them.The narrative world is getting more and more frenzied while the real world is headed toward disaster due to the military and ecological pressures created by our status quo. There are only a few ways this can possibly break, with the most obvious being mass scale climate disaster or nuclear war. There is also the possibility that the human species goes the other way and adapts. Organisms always wind up hitting a juncture where they either adapt to a new situation or go extinct, and we are approaching our juncture now. Throughout recorded history, all around the globe, wise humans have been attesting that it is possible to transcend our delusion-rooted conditioning and come to a lucid perception of the narrative world and reality. There are many names for this lucid perception, but the one that caught on most widely is enlightenment. We all have this potential within us. It has been gestating in us for many millennia. As we approach our adaptation-or-extinction juncture, we are very close indeed to learning if that potential will awaken in us or not.If it does, a healthy and harmonious world will shift from being an unimaginable pipe dream to something very achievable. No longer confused about the relationship between the real world and the narrative world, we will be able to perceive our actual situation clearly, unfiltered by manipulation, and begin collaborating to build something beautiful and unprecedented. Once we move out of our narrative manipulation-driven model of competition and domination, and into a lucidity-driven model of collaboration with each other and with our ecosystem, a lasting peace will open up to us all.______________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Thank you, what a simple and elegant description of our human condition. Using the articlexe2x80x99s language regularly to discuss current events and commenter behaviour will help people get out of their narrative boxes and see the bigger picture.Our mental filter is superimposed over reality. It is supposed to periodically  scan for danger and opportunities and make sense of the world. Instead it is left in the xe2x80x9conxe2x80x9d position because we have made an identity out of it. Turning it xe2x80x9coffxe2x80x9d feels like wexe2x80x99re being asked to eliminate our identity. So we think compulsively ( the original addiction from which all other addictions arise) and produce an endless narrative streamxe2x80x94 xe2x80x9cme and my life storyxe2x80x9d. Viewing life through this mental filter, we produce a distorted and incomplete perception of reality.\"the real world is headed toward disaster due to the military and ecological pressures created by our status quo.\" Uh . . . that's a \"narrative\" Caitlin. The proportion of humanity at war has been on the decline more or less continuously for decades, and environmental conditions have never been better in most of the world, including all of the developed world. Yes, according to one \"narrative\", that will all soon change, but that has not manifested itself in terms of actual bullets flying, bombs dropping, air and water becoming poisonous, etc.No posts","title":"The Real World And The Narrative World - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/the-real-world-and-the-narrative"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/biden-will-escalate-aggressions-against","id":"1","imgs":"https://cdn.substack.com/image/fetch/w_90,h_90,c_fill,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F7ddb5cf9-f1e7-4f70-bb79-a93767dab429_960x960.jpeg","readingtime":4,"text":"\"Team Biden is soft on China,\" Republican Senator Ted Cruz tweeted the other day, echoing a very common accusation that's been leveled against the president from the right with increasing frequency. Cruz, who biologically is mostly wetland parasites, is not being truthful. There is no evidence at this early stage that the Biden administration is \"soft on China\", and there is a lot of evidence that it will be the exact opposite. Just today the president announced a new Pentagon task force dedicated to countering Beijing which will be led by a virulent China hawk who has previously attacked Trump for being too soft on China.Antiwar's Dave DeCamp reports:Pentagon officials said the task force is a xe2x80x9csprint effortxe2x80x9d that will examine things like US troop presence in the region, intelligence, and the role of US allies and partners in countering China. Leading the task force is Ely Ratner, a China hawk who Biden appointed as a special advisor to Secretary of Defense Lloyd Austin.Before his new position at the Pentagon, Rather worked at the interventionist Center for a New American Security (CNAS) think tank. Despite the Trump administrationxe2x80x99s hardline policies towards Beijing, Ratner didnxe2x80x99t believe Trump was tough enough. In September 2020, he co-authored an op-ed titled xe2x80x9cTrump Has Been Weak on China, and Americans Have Paid the Price.xe2x80x9dFrom his post at CNAS, Ratner led a congressionally mandated study on China that was released in January 2020. The report outlined various ways the US could compete with Beijing in Asia, including military deterrence or a xe2x80x9ccombat-credible posture in the Indo-Pacific,xe2x80x9d as the study put it.February 11th 2021Biden has been vocal about his desire to \"confront China's economic abuses, counter its aggressive, coercive actions, push back on China's attack on human rights, intellectual property, and global governance.\" His National Security Advisor Jake Sullivan has restructured the National Security Council to prioritize countering China in the Indo-Pacific. His Secretary of State Tony Blinken, who furiously agreed with Trump's hawkish China policy, ripped Chinese officials over the treatment of Uighurs, Tibetans and Hong Kong in his very first call to Beijing after taking office. His Defense Department is sending war ships into the South China Sea.Biden is plainly governing as a China hawk, and is giving every indication that aggressions between the two powerful nations will only get more heated in the coming years. Yet sleazy Republicans like Ted Cruz and their brainwashed supporters will keep hurling accusations of Beijing sympathies at this administration.How do I know this will happen? Well besides the fact that it is happening already and has been in the works for months, I know it because it's what happened last time. Throughout his entire four years in office, Donald Trump was consistently hammered with accusations of secret Kremlin loyalty, even after the Mueller investigation failed to indict a single American for conspiring with the Russian government. These accusations did not harm Trump in any meaningful way, but they did in effect end up providing cover for him to escalate tensions against Russia more aggressively than any president since the fall of the Berlin Wall. During the 2012 presidential race, Barack Obama mocked Mitt Romney for saying that Russia was America's greatest geopolitical threat, saying \"The 1980s are now calling to ask for their foreign policy back, because the Cold War has been over for 20 years.\"Just imagine, for a moment, the reaction that American liberals would have had if they'd gone directly from that kind of narrative to the scary fascist orange man accelerating toward nuclear brinkmanship with the world's other leading nuclear weapons force. They would have freaked out about it catastrophically, because they hadn't yet been trained to hate Russia and demand increased aggressions against Moscow. Russiagate was first and foremost a mass scale psyop born of the US intelligence cartel and advancing the pre-planned agendas of the US intelligence cartel against a longtime geostrategic target.I said years ago that the ultimate target of Russiagate was not Trump or Russia but China, and we're seeing that playing out now. Moscow's increasingly close relationship with Beijing means it needs to be targeted and shoved off the world stage via economic warfare and other cold war maneuverings to weaken its ability to defend the real target China before its surging economic power can permanently end US unipolar hegemony in our world.We are watching a slow-motion third world war play out between the US-centralized power alliance and the nations which have resisted absorption into that alliance, and propaganda plays a vital role in manufacturing public consent for the various steps that need to be taken along the way to accomplish this. That is what we've been seeing with Democrats and manufactured Russia hysteria, and it's what we're seeing with Republicans and manufactured China hysteria as well.February 8th 2021If you can create a situation where the leader of one political faction is escalating aggressions against a targeted nation while the other political faction is constantly accusing him of loyalty to that same nation, you've successfully manipulated the public into actively cheering for as many world-threatening cold war escalations as you want. Not only that but you've prohibited the opposite faction from putting up any resistance to these dangerous actions because they're being politically pressured to demonstrate that they're not \"soft\" on the targeted nation, pressured to show that they are in fact far more hawkish toward that nation than their accusers are. Trump was successfully pressured to hit Russia with sanctions, menace it with an aggressive Nuclear Posture Review and troops on its border, bomb and starve its allies while tearing up crucial nuclear treaties, all while the Maddow muppets completely ignored these actions and kept insisting that Trump was acting the way you'd expect a secret Russian agent to act. The psyop worked perfectly. So why change the formula?Biden will continue to roll out aggressions against China while the rightist political/media class keeps churning out narratives that he is soft on China. Rank-and-file right wingers will be manipulated into clapping along by mass media propaganda and by internet psyops feeding them nonsense about Hunter Biden's laptop proving that his father is owned by the CCP. It won't look exactly the same as Russiagate because the subjects and demographics are not the same, but the end result will be: the escalation of the slow-motion third world war against the world's most powerful unabsorbed governments.This is such a perfect example of the way the Democratic and Republican Parties function like the jab-cross punch combination in boxing, each working together to set each other up for knockout blows. They don't look the same, and they aren't used in exactly the same ways, but they're both used in conjunction to advance the same goal: punching the rest of humanity in the face until it falls.__________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Cruz can whine about a \"soft\" China policy all he wants, but it won't get traction in corporate media except possibly OAN.  The media is too busy repeating that he's trying to have AOC killed and reporting on the impeachment circus.Hi Caitlin and thank you for publishing this piece!Regarding your prediction:\"the escalation of the slow-motion third world war against the world's most powerful unabsorbed governments\".How would this escalation(s) look like in the real world?No posts","title":"Biden Will Escalate Aggressions Against China While Republicans Call Him A BeijingÂ Puppet - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/biden-will-escalate-aggressions-against"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/biden-continues-trumps-war-on-the","id":"2","imgs":"https://cdn.substack.com/image/fetch/w_600,h_314,c_fill,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fa6c90ae4-7216-46c9-9739-df24435f422d_1200x800.jpeg","readingtime":3,"text":"Just one day after a coalition of prominent civil rights groups made headlines with a letter urging the Biden administration to drop efforts to extradite WikiLeaks founder Julian Assange to the United States on espionage charges, the Biden administration has announced its intention to continue those efforts.\"Justice Department spokesman Marc Raimondi on Tuesday said the U.S. government will continue to challenge a British judgexe2x80x99s ruling last month that Assange should not be extradited to the United States because of the risk he would commit suicide,\" Reuters reports.xe2x80x9cWe continue to seek his extradition,xe2x80x9d Raimondi said.Reuters @ReutersFebruary 9th 2021Assange's arrest and subsequent charges under the Espionage Act in 2019 for what amount to standard journalistic practices which exposed US war crimes marked both a dramatic escalation in the US empire's war on critical national security journalism and a sharp divergence from the Obama administration's decision not to pursue such charges in this case. Biden is not just upholding Trump's assault on press freedoms (far and away the single most egregious attack on journalism in the 45th president's entire four years in office), he is rejecting the Obama administration's decision not to charge Assange due to concerns that it would erode the First Amendment. As The Washington Post reported during Barack Obama's second term in 2013:\"The Justice Department has all but concluded it will not bring charges against WikiLeaks founder Julian Assange for publishing classified documents because government lawyers said they could not do so without also prosecuting U.S. news organizations and journalists, according to U.S. officials.\"...xe2x80x9cThe problem the department has always had in investigating Julian Assange is there is no way to prosecute him for publishing information without the same theory being applied to journalists,xe2x80x9d said former Justice Department spokesman Matthew Miller. xe2x80x9cAnd if you are not going to prosecute journalists for publishing classified information, which the department is not, then there is no way to prosecute Assange.xe2x80x9dNothing about this has changed. The Trump administration did not have access to any evidence that the Obama administration did not also have in 2013, it just chose to squint at the law from a different angle and legally interpret Assange's journalistic activities as a violation of the Espionage Act. There is nothing whatsoever preventing other journalists around the world from facing the same fate under similarly dubious legal interpretations. The US Department of Justice is not going to be using other people's personal definitions of what constitutes legitimate journalistic activity going forward, it's going to be using its own.November 16th 2018Biden's divergence from the Obama administration's less authoritarian position on the matter should not come as much of a surprise, since he took an absurdly hard line against WikiLeaks after the first publications of the earth-shattering Manning leaks in 2010.\"I would argue it is closer to being a hi-tech terrorist than the Pentagon papers,\" Biden said of Assange at the time. \"But, look, this guy has done things that have damaged and put in jeopardy the lives and occupations of people in other parts of the world.\"It should also come as no surprise because, all things considered, this administration has not been much different from the previous one in terms of actual policy. The policy of regime change interventionism in Venezuela is the same. The policy of hawkishness toward China is the same. The policy of starvation sanctions against Iran is effectively the same. In a recent CNN interview Secretary of State Tony Blinken could not speak highly enough of Trump's more incendiary foreign policy decisions like moving the US embassy to Jerusalem and recognizing the illegally occupied Golan Heights as Israeli territory. There are far, far more similarities between the Trump administration and the Biden administration than there are differences. As is consistently the case with US presidents, the narratives are different, the campaign platforms are different, the political parties are different, but the actual policies and behaviors remain more or less the same.The Situation Room @CNNSitRoomFebruary 9th 2021None of this means we should stop fighting tooth and claw for Assange's freedom: the fight is far from over. There is still time for the Biden administration to opt against appealing the UK court decision not to extradite, thereby leaving the entire embarrassing extradition attempt on Trump's lap.\"The US may submit its Assange appeal filing by Friday to meet its deadline, but one would expect a serious policy decision to be made by the new Attorney General who, once confirmed, can review the incredibly weak case against Assange in full before making a determination,\" a statement by the Courage Foundation reads. \"Reports are circulating that an interim spokesperson says the Biden admin will continue the Assange case. The incoming DOJ, whose Attorney General is yet to be confirmed, can drop the charges against Assange at any time, including after this Fridayxe2x80x99s appeal deadline.\"So we keep pushing. We cannot allow a corrupt and murderous globe-spanning empire to effectively outlaw inconvenient journalism around the world in the way it would by setting the legal precedent it is trying to set with the Assange case. If journalists everywhere know they can be extradited and imprisoned for publishing inconvenient facts about the US-centralized empire, they will largely refrain from doing so. And that is the whole idea.Through WikiLeaks Julian Assange has revealed a lot of damning information about the most powerful entities on our planet, but by far the most damning revelation he provided was not a WikiLeaks release at all: it was the revelation that \"free democracies\" like the US and the UK will openly imprison and torture a journalist for telling the truth. This has been seen, and it cannot be unseen. We owe him a great debt for bringing such facts into the light. The least we can do is try to get him out of there now.______________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.This piece is tripe - not that I have come to expect anything less from Ms. Johnstone. Stealing government secret correspondence, spraying it all over the floor and telling people to knock themselves out to find government secrets is not journalism. In many ways, it is the opposite of journalism. Philip Graham said journalism is the first draft of history. This is the first shitstain of history. Contextless, insightless, and distracting those like Ms. Johnstone from seeing what the hell is actually going on. Julian Assange is not worth this kind of - well, I was going to say xe2x80x9cattentionxe2x80x9d but itxe2x80x99s actually hero worship not unlike what the right is doing with our orange former president.Another excellent and informative piece from Ms Johnstone. This situation presents the Left in the USA and UK with a dilemma: how do they reconcile their adoration of Joe Biden with this? I suspect that we'll see a lot less activism on Mr Assange's behalf than we did when it was so easy to blame the persecution on Trump. I hope I'm wrong and that Mr Assange is freed soon.No posts","title":"Biden Continues Trump's War On TheÂ Press - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/biden-continues-trumps-war-on-the"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/democrats-want-to-lose-the-midterms","id":"3","imgs":"https://cdn.substack.com/image/fetch/w_66,h_66,c_fill,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F2fc2209a-2c3a-4839-95a3-d2f86590ac68_325x320.jpeg","readingtime":74,"text":"Americans: We're dying!Republicans: Good.Democrats: We hear you and we honor your experience.xe2x9dx96The USA is the single worst human rights offender on our planet. The fact that most of its transgressions take place outside its own borders makes it more egregious, not less. So-called human rights watchdog groups which fail to acknowledge this fact are propaganda constructs.xe2x9dx96By 2024 the only mainstream US political debate allowed will be about whether America should nuke Russia or China.xe2x9dx96xe2x80x9cKindly let me help you or you will drown, said the monkey putting the fish safely up a tree.\" ~ Alan WattsInterventionist foreign policy in a nutshell.xe2x9dx96War is insanity. Unjust war is criminal insanity. One of the ugliest things about western imperialism is the way it gives extremely young soldiers whose minds have been warped by a criminally insane war machine the power of life and death over defenseless populations.xe2x9dx96One very important thing you can do is keep finding new ways to help people see the horrors of imperialism with fresh eyes. It's all so aggressively normalized and it's been going on all our lives, so it's easy to get used to it and lose sight of how unspeakably horrific it is.xe2x9dx96Choosing to continue an immoral course of action is as immoral as initiating it. Presidents who continue the immoral policies of their predecessors are as culpable as the presidents who initiated them.xe2x9dx96The Democratic Party is corrupt and murderous beyond the possibility of redemption and anyone who says otherwise is either deceived or deceiving.xe2x9dx96I'm seeing US progressive/DSA types getting more and more agitated about the sudden increase in hostility toward the Democrats from the left. What did they think was going to happen when the Dems took control of the entire government? You're the power now, buttercup.xe2x9dx96The problem with warning that the $2000 check scandal will lead to losses in the midterms is that Democrats are fine with losing in the midterms. You think they like having to own all their right wing bullshit for themselves? Democrats hate being exposed and vulnerable like this. They much prefer to blame their corporate cronyism, austerity policies and warmongering on an obstructionist Republican congress. They're happy to lose the midterms. They prefer to lose the midterms.xe2x9dx96The easiest way to look cool is to fight the power. The easiest way to get rich is to serve the power. The easiest way to look cool and get rich is to serve power while appearing to fight it.xe2x9dx96Democrats are absolutely correct that it is of paramount importance for the Republicans be held accountable for their atrocious crimes lest those crimes repeat themselves in the future.Start with the Bush administration.xe2x9dx96Immense military and financial commitments are made to Israel on the grounds that it's \"the only democracy in the Middle East\", but also if you try holding it to the same standards as other democracies you're a Nazi.And also Israel is not a democracy. Obviously.xe2x9dx96If I saw someone criticizing the many, many horrible things the Australian government has done, it would never in a million years occur to me to rush to Australia's defense. Yet I interact with people hastening to defend the US empire on a daily basis. These people are silly.xe2x9dx96World peace and inner peace are not separate endeavors. Go deep enough into one and you'll eventually find yourself working on the other as well.xe2x9dx96If humanity can't collectively transcend egoic consciousness it won't matter if the revolution succeeds; even if we create worldwide utopia we'll only end up destroying it out of boredom. Conflicts with each other and with nature will keep rebirthing until inner conflicts vanish.__________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Those of us actually on the (radical) left really have no choice but to continually reveal the corrupt bloviating mendacity of the Dems and their minions, else we risk bring subsumed into that revolting matrix as \"the left\".  Thanks for being so clear about these charlatans.Alan Watts had great simple fixes for government like making politicians more like civil servants - not celebrities - who weren't motivated by wealth, fame and power to enrich themselves and the members of their elite community.No posts","title":"Democrats WANT To Lose The Midterms: Notes From The Edge Of The Narrative Matrix - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/democrats-want-to-lose-the-midterms"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/bidens-iran-policy-is-just-trumps","id":"4","imgs":"https://cdn.substack.com/image/upload/w_728,c_limit/l_twitter_play_button_rvaygk,w_120/vyydb1woipewshakoz4e","readingtime":97,"text":"In a new interview with CBS Evening News, President Biden confirmed that his administration will not be lifting sanctions imposed upon Iran in order to bring Tehran to the negotiating table for the restoration of the Joint Comprehensive Plan of Action (JCPOA), commonly known as the Iran nuclear deal.\"Will the U.S. lift sanctions first in order to get Iran back to the negotiating table?xe2x80x9d Biden was asked by CBS's Norah O'Donnell.\"No,\" the president replied.\"They have to stop enriching uranium first,\" asked O'Donnell.Biden nodded in response.February 7th 2021There are a few things that are ridiculous about this, the first being that the JCPOA does not require that Iran \"stop enriching uranium\" at all. As explained by Al-Monitor's Arash Karami, the deal only calls for Iran to \"keep its level of uranium enrichment at up to 3.67 %\", a level it only began exceeding when the Trump administration backed out of the deal and imposed sanctions. The administration later clarified that Biden meant Iran would have to return to its JCPOA levels before negotiations could begin, but the fact that neither the United States president nor the high-profile reporter interviewing him appear to have been clear on this says a lot about the vapid nature of America's political/media class.More importantly, this is confirmation from the horse's mouth that Biden is in effect continuing Trump's Iran policy. Trump began strangling Iran with crushing sanctions in an effort to force it to obey US dictates, and Biden is continuing that exact same strangulation while continuing to demand compliance with its dictates. The demands might be a little different, but the effect is identical since Tehran would never bow to either of them.The Iranian government has repeatedly made it abundantly clear that it will not be rejoining the JCPOA until the United States comes back into compliance, since it was the US who first abandoned it. It claims, correctly, that it was in full compliance with the agreement when the Trump administration unilaterally backed out in May 2018. The argument that it is therefore Washington's responsibility to come back into compliance first is indisputable. Why would it re-enter a deal with a government that is clearly acting in bad faith and could just back out and impose civilian-killing sanctions on the nation again?January 26th 2021And that's just getting back to the negotiating table for re-entering the deal as it is written. Gareth Porter reported last month that the Biden administration may plan on using the sanctions regime it inherited from the previous presidency as a \"Trump card\" to try and coerce Tehran into agreeing to a modified version of the deal. Neither of these things are going to happen. Iran will not modify the deal, and it will not come back into compliance before the government which first abandoned the deal comes back into compliance. And the Biden administration appears to be perfectly fine with this, reportedly toying with the idea of waiting all the way until after Iran's presidential elections in June to even begin approaching the deal.The end result being that we still have a US presidency waging economic warfare upon Iran in exactly the same way it was before the 20th of January. Civilians are still having the life squeezed out of them by a far more powerful nation which does not view them as human beings, and it's only a matter of time before this administration or a subsequent one causes another flare up which pushes things to the brink of hot war like we saw a year ago.Biden's Iran policy is in effect just a continuation of Trump's Iran policy that liberals can feel good about. It's Trump's Iran policy with gender pronouns in its bio.February 7th 2021Choosing to continue an immoral course of action is just as immoral as choosing to initiate an immoral course of action. If you're beating someone up and you leave when I get there, and then I choose to continue assaulting that person, I am just as culpable in that assault as you are. Presidents who choose to perpetuate one another's depraved policies are just as guilty of that depravity as their predecessors.Starvation sanctions are the only type of warfare in which it is considered normal and acceptable to deliberately target a civilian population with deadly force. But it is not normal, and it is not acceptable. Biden and his team of ventriloquists fully own the effects of their warmongering. They don't get to just scribble \"TRUMP'S FAULT\" across them in crayon and act like they're innocent.The mainstream media are fixated on the differences between the Biden administration and the Trump administration, just as they were fixated on the differences between the Trump administration and the Obama administration four years ago. If you can mentally mute that vapid soundtrack and look at the similarities between administrations instead, regardless of party affiliation and campaign platforms, you'll learn a lot more about what's really going on in the world._________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Yes. The Iran situation has been fxe2x80x99ed up since 1954, or even before. But the ayatollahs are every bit as bad as the worst western politician. The people of Iran DO NOT want this theocracy clamping down on them any more than you would. Itxe2x80x99s easy to decamp to New Zealand or Oz or wherever you live and pontificate on the US or Iran or Iraq, but you donxe2x80x99t live there. You live in the safest place on earth. And yes, US Imperialism is really fucked. But given the present situation, what do you think the US should do? You criticize but you donxe2x80x99t offer any alternatives. What do you think happens when Iran has nukes? You think that has a happy ending?! Haven't we seen this before with the last administration Biden was involved with? Obama continued and expanded Bush's policies and the liberals cheered what they used to be protesting against.No posts","title":"Biden's Iran Policy Is Just Trump's Iran Policy With A Rainbow FlagÂ Emoji - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/bidens-iran-policy-is-just-trumps"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/electoral-politics-use-the-same-containment","id":"5","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F33120bf7-c414-403a-9ecb-9091f30dbe95_1200x800.png","readingtime":85,"text":"In a high-quality dementia care facility, confused residents who are at risk of unsafe wandering are skillfully redirected away from exit doors by staff members who are trained to provide them with the illusion of freedom while still keeping them in the safety of the care home. A propaganda-addled populace wandering around trying to find an escape from its oppressors is redirected in very much the same way.If you've ever visited a loved one in a locked dementia care facility, especially near sunset, you know how agitated the people who live there can become. The impulse to wander and pace is very common, and depending on where they're at cognitively they'll often demand to leave the facility at once so they can go \"home\".When this happens, unskillful staff members will take an openly authoritarian position and tell the resident that they cannot leave and that the facility is their home now. This confrontational approach invariably leads to agitation on the part of the confused resident, because in their mind they really do live somewhere else and are being told they need to remain locked in a strange place that they have no memory of. This can quickly lead to a catastrophic response that is unpleasant for everyone, especially the resident in question.A more skillful staff member will employ a very different strategy. Rather than engaging in futile attempts to persuade someone with severe dementia that they must stay and that their perception of reality is wrong, they will simply say \"Ah yes, right away Mister Smith! Let's go get you ready to leave.\" They'll take him by the hand, ask him if he wants dinner before he leaves, get him talking about his time in the army, distracting him from the thought of leaving and letting the memory loss do the work for them. In a few minutes Mister Smith is happily chowing down on mechanical soft meat and potatoes without a care in the world.The fancier facilities won't even have locked doors that are immediately noticeable, with (as weather and daylight permit) the doors left unlocked to a large, enclosed garden area full of circular walkways which eventually guide a wandering resident back indoors. The actual exit point of the facility is through a building on the far end of this large yard with a staff member at the front desk who can redirect any resident who happens to meander their way through the winding paths. This way staff don't even need to worry about a resident who decides they want to leave, they can just say \"Sure thing Mister Smith! Door's right there!\" knowing he'll just wander around for a bit and come back in.Anyway, that's how electoral politics works. The public will periodically become agitated at the way their wealth and resources are being stolen from them and spent on overseas wars, or the fact that they are deliberately kept poor and busy by a plutocratic system in which the relative wealth of the rich is given more political power by the relative poverty of everyone else, and they are redirected.They are not told \"No Mister Smith, you are the property of the oligarchic empire.\" They are instead told by the skillful manipulators of the political/media class, \"Ah yes Mister Smith, you can have everything you want! Just vote for the Democratic Party right over there!\"And just as the facility's design intended, Mister Smith goes out the door to the Democratic Party, wanders around in circles for a while, then comes back inside without posing any inconvenience to the staff members who run the empire.Meanwhile the actual exit from the abusive system is kept carefully hidden. A lot of dementia care facilities will disguise their exits by painting them to look like murals or bookshelves, like this:That's where fighting the propaganda machine is hidden. That's where direct action is hidden. That's where a critical mass of people waking up from the manipulations and using the power of their numbers to directly force real change is hidden. Cleverly disguised behind a bunch of gibberish about \"conspiracy theories\", \"Russian propaganda\" and \"extremism\", with a bunch of staff members pointing the way toward a false exit that cannot ever lead to our escape.Obviously care homes are a good and necessary thing for protecting victims of Alzheimer's disease and other forms of dementia who can't be kept safe at home, whereas the system in which we all find ourselves is unforgivably abusive and malignant to its core. But the psychological principles work in exactly the same way: it's much easier and far more energy efficient to give people the illusion of freedom than to tell them they are locked up against their will. If you let the people know you stand in opposition to their will, they're going to try to fight you, so it's best to pretend you're on their side and willing to give them everything they want.That's all electoral politics is. That's all the Democratic Party is. That's all we were seeing when Americans shook the earth with Black Lives Matter protests last year while the entire establishment told them \"I hear you, I agree with you\" without ever actually making any changes. It's a locked facility we are forbidden from leaving with a bunch of staff members pretending to want what we want.But the fact that the managers of empire go to such lengths to avoid a direct confrontation with us means that they desperately want to avoid that confrontation. We are not an elderly dementia patient, we are the many. They are the few. If we can ever collectively stop falling for the redirections to the circular pathways and stand and face our oppressors, they do not stand a chance. And they know it.They cannot arrest us all. They cannot kill us all. All they can do is keep us confused and distracted, and hope we don't remember our true power. That's all this is._________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Caitlin, I always look forward to reading your essays. I rarely disagree with your observations and analysis. Few journalists  ever cut through the horse hockey to get at the truth and tbe real source of our troubles.Your remedy for empire, however, puzzles me.  Not that I disgree with direct action, but I am wondering (and I may have missed this) would you mind describing more precisely what  effectual direct action looks like? To me the actions of black lives matter has not improved the lives of Africa- Americans. Token cultural change that makes the ruling class more colorful serves only to legitimize the same violent economic system that oppresses all ethnicities. What are the specific actions that can do otherwise? Thank you for your creativity and for using it to help people understand how they are lost and confused. Interestingly, those at the top of the global hierarchy also suffer from the same mental impairments: identification with mind contentxe2x80x94our personal inner narrative filtered through hundreds of cognitive biases. So we have all xe2x80x98forgottenxe2x80x99 who we really are. All of us who completely identify with the voice in our head named xe2x80x9cmexe2x80x9d are insane. Our cruel unjust world reflects our inner madness.No posts","title":"Electoral Politics Use The Same Containment Strategies As Alzheimer's Facilities - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/electoral-politics-use-the-same-containment"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/the-empire-must-die-notes-from-the","id":"6","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1a88ec06-f21a-46b8-9c97-eb3fa9cdd485_514x239.png","readingtime":58,"text":"Q: What is a liberal?A: A liberal is a violent white supremacist extremist who supports and participates in the mass slaughter of brown-skinned human beings overseas while tweeting that white supremacist extremists are bad.xe2x9dx96Q: What is capitalism?A: Capitalism is a wonderful economic and political system which has given us powerful technology, a wide assortment of breakfast cereals, and near term human extinction.xe2x9dx96Q: What is China?A: China is a large Asiatic nation which westerners use as an emotional punching bag for their capitalism-induced rage, propaganda-induced confusion, and fears about the death of the US empire.xe2x9dx96Q: What is Israel?A: Israel is a US military operation that is used to justify continual western military expansionism in a crucial geostrategic region, with some civilians sprinkled on top for cover.xe2x9dx96Q: What is a \"tankie\"?A: Anyone to the left of you on foreign policy.xe2x9dx96Q: Who is the biggest leak source of CIA documents to the news media?A: The CIA.xe2x9dx96Q: What is the Republican Party?A: An organization which assures Americans of conservative sensibilities that the status quo is working fine.Q: What is the Democratic Party?A: An organization which assures Americans of liberal sensibilities that the status quo is working fine.xe2x9dx96Q: What's the difference between a prostitute and a mainstream media pundit?A: One gets paid handfuls of cash to do shameful and degrading things which tear apart the fabric of society, the other earns an honest living as a sex worker.xe2x9dx96You're allowed to choose between oligarchic warmongers who make you feel uncomfortable or oligarchic warmongers who make you feel comfortable. Those are your choices.xe2x9dx96The main difference between QAnon conspiracy theories and Russiagate conspiracy theories is that one makes people do dumb things like alienate their families and riot at government buildings while the other manufactures consent for cold war agendas that may end all life on earth.xe2x9dx96The difference between an anti-imperialist socialist and a Bernie Sanders progressive is far greater than the difference between a Bernie Sanders progressive and a Hillary Clinton liberal.xe2x9dx96The first thing an authoritarian power does to quash protests nowadays is always to cut the internet, because it kills dissidents' ability to organize and share information. Don't think the increasing normalization of internet censorship in the west is about anything else.xe2x9dx96I'm going to keep pointing this out until it catches on: Trump was targeted with accusations of subservience to Russia, hiding the fact that he was ramping up aggressions against Russia. Biden's being hit with accusations of loyalty to China, hiding his escalations against China.They're recycling the exact same script, and why wouldn't they? It worked. The public have been enthusiastically consenting to world-threatening cold war escalations which benefit them in no way, shape or form. It's a very effective psyop.This will continue. If you think Biden will be cuddly with Beijing, you are wrong. Please re-evaluate your worldview as the facts prove you wrong.xe2x9dx96Just as a body will fight to eject any pathogen which threatens its survival, an empire will fight to eject anyone who threatens its survival. Whenever you see a person or government targeted by the full might of the empire, that's what you're looking at.Like a shark, the empire must keep advancing or it will die. Any government or leader which stands in the way of its continual expansion around the globe is seen, correctly, as an existential threat. Not to the US as a nation, but to the empire which must keep advancing or die.This is why you'll never see a US politician actually slamming the brakes on imperialism. If anyone gets anywhere near a position where they might do so, they will be targeted and eliminated. It's the one door you're forbidden to go through, because it threatens an entire empire. They might let you advance a few mildly progressive domestic agendas, but they will never, ever let you anywhere near the possibility of ending western imperialism.In order to end the wars and move toward health, the empire will necessarily have to die. Not the United States as a nation, but the globe-spanning oligarchic power structure whose power, wealth and military might have been loosely centralized around Washington DC.And of course many of those who threaten the empire's survival won't be nice people; this isn't a Hollywood movie about Good Guys versus Bad Guys. But only the US-centralized empire is waging a nonstop war upon the world with the aim of perpetual unipolar planetary domination.Ending the empire won't solve all our world's problems. But because the empire can only survive on a steady diet of death and destruction, its death is a necessary first step toward creating a healthy, peaceful world.___________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Um, according to https://www.godaddy.com/whois/results.aspx?checkAvail=1&domain=substack.com this is a sitting duck platform for take-down:WHOIS search resultsDomain Name: SUBSTACK.COMRegistry Domain ID: 1594580975_DOMAIN_COM-VRSNRegistrar WHOIS Server: whois.registrar.amazon.comRegistrar URL: http://registrar.amazon.comUpdated Date: 2020-12-14T18:21:22ZCreation Date: 2010-04-27T18:02:41ZRegistry Expiry Date: 2021-04-27T18:02:41ZRegistrar: Amazon Registrar, Inc.Registrar IANA ID: 468Registrar Abuse Contact Email: abuse@amazonaws.comRegistrar Abuse Contact Phone: +1.2067406200Domain Status: clientTransferProhibited https://icann.org/epp#clientTransferProhibitedName Server: ALI.NS.CLOUDFLARE.COMName Server: LEE.NS.CLOUDFLARE.COMDNSSEC: unsignedURL of the ICANN Whois Inaccuracy Complaint Form: https://www.icann.org/wicf/>>> Last update of whois database: 2021-02-07T01:23:27Z <<<For more information on Whois status codes, please visit https://icann.org/eppI'm generally with you, but I do question whether if the American empire dies, whatever comes next would be any more \"healthy\" and \"peaceful\". Not sure where there's any evidence of that based on other empires in history or competing empires currently. I'm also not sure you're right about China. I don't think they're necessarily the new Third Reich or anything, but does anyone else on Earth have a million ethnic minorities in concentration camps?No posts","title":"The Empire Must Die: Notes From The Edge Of The Narrative Matrix - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/the-empire-must-die-notes-from-the"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/youre-not-a-radical-youre-just-sane","id":"7","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F71c15a2b-f91f-4f60-8d5a-7bab811b5683_960x639.jpeg","readingtime":6,"text":"In response to rumors that Bernie Sanders foreign policy advisor Matt Duss may be playing some role in the Joe Biden State Department, bloodthirsty psychopath Nikki Haley told the Washington Free Beacon that this \"is another indication that the only unity in Bidenxe2x80x99s foreign policy is between the far left and the extreme left.\"Which is of course ridiculous. Taken as a whole Biden's imperialist foreign policy has not differed much from Trump's, and Duss is a fairly reliable imperialist himself. This administration is not an \"extreme\" deviation from the norm, and much less a manifestation of anything that could be called \"extreme left\".February 4th 2021This nonsense comes out at the same time we learn that Secretary of Defense Lloyd Austin has put a bunch of US military operations on hold, not because those military operations are depraved acts of mass murder driven by the megalomaniacal agenda to dominate the entire world, but to hold \"needed discussions\" about the possibility that there may now be \"extremists\" among their ranks.\"Secretary of Defense Lloyd Austin has ordered a staggered pause of operations across the entire US military so commanders can have 'needed discussions' with service members about the issue of extremism over the next 60 days,\" CNN reports. \"The issue of extremism in the military has been at the forefront since the January 6 riot at the US Capitol. At least 22 people either formerly or currently associated with the military were charged in connection with the riot.\"That's right, the US military has for decades been merrily incinerating entire families, ripping apart children with cluster munitions, and destroying whole nations for disobeying US imperial dicates, but now they need to pause some of that normal, wholesome activity because a few bad apples might perhaps have succumbed to extremism.Devastating Iraq, turning Libya into a failed state, facilitating genocide in Yemen, waging an endlessly expanding 'war on terror' and brandishing armageddon weapons at your enemies? That's fine and normal. Members of the military joining hate groups and believing in QAnon? That's extremism.February 4th 2021This all just goes to show how completely meaningless the mainstream concepts of \"normal\" and \"extreme\" have become when talking about politics and power in our insane world. When you oppose the horror that is western imperialism people try to paint you as a radical extremist who can't just be reasonable and pragmatic about things, but really nothing could be further from the truth. There's nothing \"radical\" or \"extreme\" about opposing the domination of the entire planet with relentless acts of mass slaughter to the detriment of the world's most vulnerable populations, all because some sociopaths in DC decided that it is good and reasonable to inflict any amount of terror upon our world to preserve unipolar US hegemony. Opposing this is just basic human sanity.People will act like you're unreasonable and impossible if there's not a single US politician you support.\"Not even Bernie?\" they'll ask. \"Not even AOC?? What's wrong with you?!\"If you are an anti-imperialist, being asked to choose a US politician you support is like being asked to pick a favorite Nazi. The US empire is the single most evil and destructive power on our planet right now and everyone on Capitol Hill is an imperialist facilitator of mass murder, yet you'll be treated like an extremist moonbat if you don't like any of them. The problem isn't that an anti-imperialist has strange, impossible standards, it's that they oppose an insane and murderous status quo which only elevates leaders who will advance that status quo.February 5th 2021The same goes for socialism. There's nothing \"extreme\" or \"radical\" about believing the poor shouldn't be left to suffer and die and that workers should own the full value of their labor. It's not some crazy wingnut ideal to believe we should abandon the political and economic model of profit-chasing as the driving motivator for human behavior at mass scale which has driven our species to the brink of extinction. You're not an extremist if you oppose a system which crushes human beings to death at home and abroad for the power and profit of the very few, you're just normal.You're not a \"radical\", you're just sane. This is why I think it's important for sane people to reject such labels; there's a coolness factor which comes with presenting yourself as a radical, but it comes at the price of normalizing the status quo which is itself the epitome of violent extremism. Don't let that bat shit crazy model define you by setting the status quo up as \"normal\" and yourself as a \"radical\" deviation therefrom. They are the radical ones. You are just normal and sane.Abnormalize the status quo and normalize sanity. Put your energy into helping the world see how bat shit insane their \"normal\" really is. The status quo isn't the baseline of normality, sanity is. A sane, healthy world would look wildly different from this one, and we need to help people get clear on the distinction so we can all start creating that world together._________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.moonbat variant of the corona sweeping the world, extremely virulent, only hope a new vaxx or booster shot of corporate propagandaWay Upstream - with COVID Nineteen? https://wirralinittogether.blog/2021/02/05/way-upstream-with-covid-nineteen/No posts","title":"You're Not A Radical, You're Just Sane - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/youre-not-a-radical-youre-just-sane"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/youtube-financially-deplatforms-swath","id":"8","imgs":"https://cdn.substack.com/image/twitter_name/w_36/FordFischer.jpg","readingtime":33,"text":"The Google-owned video sharing platform YouTube has demonetized numerous independent media accounts, a jarring escalation in the steadily intensifying campaign against alternative news outlets online.Progressive commentators Graham Elwood, The Progressive Soapbox, The Convo Couch, Franc Analysis, Hannah Reloaded and Cyberdemon531 have all received notifications from YouTube that their videos are no longer permitted to earn money through the platform's various monetization features, as has Ford Fischer, a respected freelancer who films US political demonstrations. No explanation has been offered for this decision beyond the vague claim that \"your channel is not in line with our YouTube Partner Program policies\" due to \"harmful content\".February 3rd 2021Like all large online platforms, YouTube's appeals process is notoriously opaque and unaccountable. These accounts could remain demonetized for months, or forever, without any clear explanation at all. Ford Fischer, who has been in this situation before, said on Twitter that his account was left demonetized for seven months before YouTube reversed its decision.\"Last time you demonetized my channel, I spoke out for seven months. I didn't delete a single piece of content. You admitted you were wrong. I forgive you. Please don't do this again,\" Fischer tweeted.\"No superchats, no ad revenue, no YouTube premium money,\" tweeted Elwood, who also said \"I have a call with my lawyers later today.\"\"You guys have destroyed my channel without legit explanation as to why,\" tweeted Jamarl Thomas of Progressive Soapbox. \"No videos are given - and frankly there is literally zero 'harmful' content on my channel. This is a radically bad error that needs to be corrected.\"The Convo Couch's Jonathan Mayorca tweeted the notification he received from YouTube which gave the reason as \"Harmful content: Content that focuses on controversial issues and that is harmful to viewers,\" saying no specific video or subject was named. Nobody receiving these notifications appears to have any idea what is meant by \"harmful\" or \"controversial\" or why YouTube is mentioning them in the same breath as though these two things are connected or synonymous in some way.Graham Elwood @grahamelwoodFebruary 2nd 2021YouTube has been providing template responses saying \"We recommend making the needed changes to your content and reapply in 30 days\" while refusing to specify what the \"needed changes\" even are.Speaking for myself, I can say with absolute certainty that I would not be able to create content at anywhere near the pace I do were I not making enough money from it to do it full time. Life is far too demanding with far too much else going on for me to be able to maintain anything like daily output; being financially deplatformed and having to get another job would force me down to an essay a week in my spare time, if that. Anyone who works in independent media full time knows this, and so do the powerful people who are steadily ratcheting up the campaign to silence anyone who hasn't passed through the gatekeepers of the plutocratic media.Financial deplatforming is censorship. People were given an opportunity to devote themselves to the vocation of creating media outside the gatekeeping apparatus of billionaire news institutions, which is arguably the single most important vocation anyone can give themselves to in our world right now, and they built their lives around their ability to do this. Now it's being ripped away from them; their literal jobs are being taken away. They were offered a reason to think they'd be able to make a living doing very important work, and then they were sucker punched with what amounts to political censorship.This has been a continually escalating trend for years. The general population is herded onto huge monopolistic social media platforms offering democratization of information where your voice can be heard, and then those platforms proceed to censor an increasing amount of political speech in increasing coordination with the US government. February 3rd 2021If the democratization of information online is successfully reversed and the mass media gatekeepers are again the sole authorities on what's real and true, people will be locked into forming their ideas on how to think, act and vote based on what they are told by the same plutocratic media institutions which have been deceiving them into every war and manipulating them into accepting the status quo for generations.If the door is locked to the possibility of a grassroots information rebellion against the narrative hegemony of our rulers, we will remain doomed to continue along the same ecocidal, omnicidal trajectory these bastards have us on until it reaches its inevitable conclusion. This must be resisted.__________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.We're living in a Kafkaesque nightmare, where you're accused of a crime but not told what it is, with no chance to defend yourself. I feel for anyone who's built their livelihood on these platforms, but on the other hand, the writing was on the wall once Alex Jones was purged. He was the canary in the coalmine. A few short years later, the president himself is silenced, and people in the mainstream media are talking out loud about shutting down Fox News and creating a \"reality czar\" (a.k.a. a real-life Ministry of Truth). None of this is going to end well.Now that leftists are being demonetized and silenced, maybe we'll stop hearing so many people make the disingenuous argument that private companies can do whatever they want. When corporate monopolies with a stranglehold on the public square manipulate who can speak, they're altering the public discourse. They should no more be able to do what they're doing than the phone company should be able to cancel you because they don't like what you said on your last phone call. Something has to be done.demanding youtube or any silly-cons for anything is just a performative waste of time and energy.  1) find new and more ways to spread exactly what the ghouls want to suppress, 2) for boycott purposes, make and share lists of the advertisers on youtube and any other silly-con platforms, 3) make advertisements very very very expensive without return.  let's see who kneels first. No posts","title":"YouTube Financially Deplatforms Swath Of Indie MediaÂ Accounts - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/youtube-financially-deplatforms-swath"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/the-lesson-of-the-blm-protests-notes","id":"9","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F3bb8bf2e-9b64-432d-9c06-4338f1b667f9_514x239.png","readingtime":61,"text":"Remember when Americans shook the earth with massive protests demanding an end to the police state and the entire liberal establishment just kept saying \"I hear you, I agree with you\" and then did absolutely nothing to even reduce police brutality? It's important to remember such lessons.People would ask me \"Why are you supporting Black Lives Matter Caitlin?? Don't you see all the corporations and corporate Dems support it? Why would they do that if it didn't serve them?\" This is why they did it. Empty words of support can defuse a situation far easier than open opposition.Imagine if all the plutocrats, pundits and politicians had just yelled at the BLM protesters and admonished them to stop? It would have only turned people against them with far more aggression, and it would have exposed the fact that they are the enemy. It's much more effective to say \"I hear you, I agree with you\" with no intention of taking any real action.And really this is all institutions like the Democratic Party exist to do: defuse left populism and crush grassroots activism not with opposition, but with empty words of agreement that have no intention of action behind them. They're just a bottomless pit that tricks people into pouring their energy into it, thereby stopping all leftward movement.A kid who doesn't want to clean their room will tell their parents \"No! I don't wanna!\" A very clever kid who doesn't want to clean their room will say \"Yes! I'll get on that right away\" and then enjoy hours of peace and relaxation without parental nagging, and without cleaning. It's the exact same way with the powerful. It's much more efficacious for them to pretend to be on your side than expose the fact that they're not. In the end the result is the same: the kid doesn't clean their room. But they don't get the kind of pushback they'd get if they said no.Manipulators are good at manipulation. The people who make their way to the top in a corrupt system are manipulators. You can't take their words at face value, mustn't mistake vapid placation for victory. They'll happily give you a mountain of words in exchange for your real treasure.xe2x9dx96They're so used to manipulating Americans into believing narratives that wildly differ from reality they were like \"We'll tell them $1400 is $2000, they won't notice.\"xe2x9dx96The world would be greatly improved if Americans became far more powerful and their government/military/media became far less powerful.xe2x9dx96Yemen alone, just by itself, is a sufficient argument for the dismantling of the entire US-centralized power alliance.xe2x9dx96To be clear, Yemen isn't some tragedy that we are passively witnessing. Civilians are being deliberately targeted and starved with the backing of the US, UK, Australia, Canada and France. Our governments are helping to inflict this horror upon innocents. And it may get worse.xe2x9dx96A world order which can create something as horrific as the atrocities in Yemen or the unforgivable Iraq invasion is not a world order that will lead the world in a good direction. The facts are in. The US-led world order must end.xe2x9dx96\"You hate all US politicians Caitlin! You can't name a single one you like!\"That's like wanting me to pick a favorite Nazi leader. It's a system which only elevates assholes who will cooperate with a machine that is fueled by human blood. You just don't see how ugly it is yet.xe2x9dx96Anti-imperialism makes you look like a radical, because it makes you reject even the politicians who are considered \"radical\" in mainstream discourse since they are all imperialists. In reality there's nothing radical about opposing the mass slaughter of innocents; it's just being a normal human being. Basic human sanity is often painted as \"radical\" because most people have no understanding of how bat shit insane our current world order is.xe2x9dx96The surest way to get rich in media is to spread lies which serve the interests of the powerful. The surest way to get labeled a \"grifter\" is to do literally the exact opposite of this.xe2x9dx96It's not enough to reject mainstream politics, we need to reject mainstream culture as well. The propagandists understand that politics is downstream from culture, so we should too. The culture manufacturers in New York and LA are not your friend; they are an extension of the empire.We who oppose the empire must reject its manufactured culture with the same disgust with which we reject its political lackeys and news media. We must create our own culture to outshine the manufactured garbage they are shoving down everyone's throats.xe2x9dx96If you want normal people to listen to an idea, you've got to make it easy to understand and you've got to make it interesting. No normal human being going about their life has any incentive to listen to you unless you do both of these things. The onus isn't on them, it's on you.Telling people to read theory doesn't work. How narcissistic would you have to be to think you can just tell some stranger to read Marx or Lenin or whatever and they'll go \"Well that complete rando ordered me to invest my scarce time and energy in this so I'd better do it\"? No. This is our job.Whenever I bring this up people say stuff like \"It's not a popularity contest Caitlin\". Yes it fucking is! You want your ideas to be more popular than the shitty, self-destructive, soul-crushing, world-destroying ideas which support the status quo. This won't happen by itself.It's not enough to be right. You can't save the world just by holding the right beliefs in your obscure corner of the information ecosystem. That's like believing life will reward you if you're a nice person on the inside. Share the ideas. Make them simple, make them interesting.xe2x9dx96One of the many advantages manipulators have over sincere people is that sincere people have no idea how very, very much better at manipulation a manipulator is than them, in the same way a chess newbie has no understanding of how many skill levels they are below a chess master.This is why it's so important for us to have the humility to know that we can be manipulated, and that we can be manipulated in ways we hadn't even thought of. Ways we wouldn't think of in a million years, because we are not that sort of creature.xe2x9dx96When you're in an abusive relationship, leaving seems impossible. After you escape, you look back and see that most of the barriers to leaving which felt so real at the time were illusory mental constructs. Escaping our abusive relationship with our oppressors will be like that.Freeing ourselves and creating a healthy world is not impossible. There are no solid walls preventing us from leaving the abusive relationship. The door's not even locked. The only thing holding us in place is mental manipulation via mass media propaganda. It's all in our head.______________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.\"It's not enough to reject mainstream politics, we need to reject mainstream culture as well. \"Here are your real revolutionaries, Caitlin.  By seeking local self-sufficiency, they are defunding the industrial system that destroys our planet and eliminating the surplus economic production that funds imperialism, domestic surveillance and foreign expropriation and adventurism. https://www.the-sun.com/news/1074573/collapsologists-civilisation-crumbles-coronavirus-preppers-prepared/Tulsi, Ron Paul....    Good people everywhereNo posts","title":"The Lesson Of The BLM Protests: Notes From The Edge Of The Narrative Matrix - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/the-lesson-of-the-blm-protests-notes"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/the-real-world-and-the-narrative","id":"10","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F462e9edc-55bd-4704-813a-48c6fd6eadfa_1025x699.png","readingtime":71,"text":"We each inhabit two very different worlds simultaneously: the real world, and the narrative world.The real world is the physical world of matter, of atoms and molecules and stars and planets and animals wandering around trying to bite and copulate with each other. Science does not yet understand much of this world, but it can reasonably be said to have some degree of existence to it.The narrative world is made of stories, of mental chatter about what's going on. It is only related to the real world in the loosest of terms, and commonly has no relation to the real world whatsoever.In the narrative world you exist as a person with a certain name and a certain life story with a mountain of adjectives attached to you, some believed consciously and some believed subconsciously. You are this, you are that. You are inadequate. You are inferior. You are clever. You are fat. You are unlovable. Whatever. Words, words, words, words, words.In the real world what you think of as \"you\" exists as an organism, breathing and digesting and pulsing and moving in the appearance of time. No thoughts or words need to occur for this organism to exist; it just is whatever it is.In the narrative world, your surroundings are experienced as friends and foes, good and bad, right and wrong, threatening and non-threatening. Churning, babbling stories about what's happening pervade the experience of the narrative world: those people over there are bad people and should be punished. Those people over there are the good people and they should be rewarded. That man is blah blah blah. That woman is this and that. In the real world, your surroundings are experienced as raw sensory data: sensory impressions arising in each point in spacetime. Breath going in, breath going out. The feeling of feet on the ground. Sound of a bird call. Sight of a passing car. It's all just happening as it is, as whatever it is. Simple. Present.In the narrative world, the United States changed dramatically on the 20th of January. If you live in one narrative echo chamber it changed dramatically for the better, if you live in the other narrative echo chamber it changed dramatically for the worse. But throughout the narrative world most agree that the 20th of January 2021 marked a very real and significant turn of events.In the real world, things are moving in pretty much the same ways they were on January 19th. The money is moving in more or less the same directions at more or less the same rates. The weapons and troops are moving to more or less the same places in basically the same ways as before. The resources are behaving in essentially the same way. The people are moving in pretty much the same way. The actual, physical dynamics have remained predominantly unchanged.The real world and the narrative world could not be more different. Skilled manipulators exploit these differences for their benefit like foreign exchange traders exploit the differences in world currency values. A religious manipulator can get you to hand over your real currency in exchange for narrative currency about eternal salvation or spiritual purification. A sexual predator can manipulate you into trading the real currency of sex for the narrative currency of \"I think I'm in love with you\". A politician can manipulate you into trading the real currency of votes for the narrative currency of whatever they say on the campaign trail.It's very hard to control people in the real world by just using the means that are available in the real world. If you're bigger and stronger than someone you can get them to hand over their sandwich by hitting them, or if you have a big stick or something. If you want to exert a large amount of control over a large number of people, though, you generally have to seize that control through the narrative world.It's easier to control people through the narrative world than the real world because the narrative world and its relationship with the real world is too complicated for most people to understand, whereas the real world is quite simple and straightforward. For this reason, a tremendous amount of energy goes into controlling the dominant narratives, the dominant stories that people tell about what's going on in the world.Convince people to accept the narrative that a government's leader is an evil dictator in need of regime change, and you can trade that narrative for real world control over a crucial geostrategic region. Convince people to accept that the status quo is working fine and any attempts to change it are dangerous insanity, and you ensure that people will never rise up and take away your real world control. Convince people that anyone questioning your narratives is a conspiracy theorist or a Russian propagandist, and you ensure your continued hegemonic control over the narrative world.The most powerful manipulators are the ones who have succeeded in exerting control over both the real world and the narrative world, and they pursue both agendas with equal emphasis. Populations in the real world who insist upon their own national, resource, financial, economic or military sovereignty are subject to real world attacks by bombs, starvation sanctions and special ops. Entities in the narrative world which threaten imperial narrative domination are attacked, smeared, marginalized and censored.That's all we are seeing with the increasingly shrill mainstream panic about disinformation, conspiracy theories, foreign propaganda and domestic extremism. Our rulers and their media lackeys are not compassionately protecting us from deception, they are ensuring that they remain the only ones authorized to administer deception. By golly the only ones allowed to deceive us should be our government, our news media, our teachers and our priests.As China and its allies increasingly threaten the real world hegemony of the US and its allies, operations in the narrative world are getting increasingly heated and intense. Expect continued demonization of Russia, and expect anti-China propaganda to get more and more noisy. Expect people to be herded into partisan echo chambers with thicker and thicker walls in the narrative world, because dividing them up in this way makes it much easier to administer propaganda to them.The narrative world is getting more and more frenzied while the real world is headed toward disaster due to the military and ecological pressures created by our status quo. There are only a few ways this can possibly break, with the most obvious being mass scale climate disaster or nuclear war. There is also the possibility that the human species goes the other way and adapts. Organisms always wind up hitting a juncture where they either adapt to a new situation or go extinct, and we are approaching our juncture now. Throughout recorded history, all around the globe, wise humans have been attesting that it is possible to transcend our delusion-rooted conditioning and come to a lucid perception of the narrative world and reality. There are many names for this lucid perception, but the one that caught on most widely is enlightenment. We all have this potential within us. It has been gestating in us for many millennia. As we approach our adaptation-or-extinction juncture, we are very close indeed to learning if that potential will awaken in us or not.If it does, a healthy and harmonious world will shift from being an unimaginable pipe dream to something very achievable. No longer confused about the relationship between the real world and the narrative world, we will be able to perceive our actual situation clearly, unfiltered by manipulation, and begin collaborating to build something beautiful and unprecedented. Once we move out of our narrative manipulation-driven model of competition and domination, and into a lucidity-driven model of collaboration with each other and with our ecosystem, a lasting peace will open up to us all.______________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Thank you, what a simple and elegant description of our human condition. Using the articlexe2x80x99s language regularly to discuss current events and commenter behaviour will help people get out of their narrative boxes and see the bigger picture.Our mental filter is superimposed over reality. It is supposed to periodically  scan for danger and opportunities and make sense of the world. Instead it is left in the xe2x80x9conxe2x80x9d position because we have made an identity out of it. Turning it xe2x80x9coffxe2x80x9d feels like wexe2x80x99re being asked to eliminate our identity. So we think compulsively ( the original addiction from which all other addictions arise) and produce an endless narrative streamxe2x80x94 xe2x80x9cme and my life storyxe2x80x9d. Viewing life through this mental filter, we produce a distorted and incomplete perception of reality.\"the real world is headed toward disaster due to the military and ecological pressures created by our status quo.\" Uh . . . that's a \"narrative\" Caitlin. The proportion of humanity at war has been on the decline more or less continuously for decades, and environmental conditions have never been better in most of the world, including all of the developed world. Yes, according to one \"narrative\", that will all soon change, but that has not manifested itself in terms of actual bullets flying, bombs dropping, air and water becoming poisonous, etc.No posts","title":"The Real World And The Narrative World - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/the-real-world-and-the-narrative"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/biden-will-escalate-aggressions-against","id":"11","imgs":"https://cdn.substack.com/image/twitter_name/w_36/Antiwarcom.jpg","readingtime":5,"text":"\"Team Biden is soft on China,\" Republican Senator Ted Cruz tweeted the other day, echoing a very common accusation that's been leveled against the president from the right with increasing frequency. Cruz, who biologically is mostly wetland parasites, is not being truthful. There is no evidence at this early stage that the Biden administration is \"soft on China\", and there is a lot of evidence that it will be the exact opposite. Just today the president announced a new Pentagon task force dedicated to countering Beijing which will be led by a virulent China hawk who has previously attacked Trump for being too soft on China.Antiwar's Dave DeCamp reports:Pentagon officials said the task force is a xe2x80x9csprint effortxe2x80x9d that will examine things like US troop presence in the region, intelligence, and the role of US allies and partners in countering China. Leading the task force is Ely Ratner, a China hawk who Biden appointed as a special advisor to Secretary of Defense Lloyd Austin.Before his new position at the Pentagon, Rather worked at the interventionist Center for a New American Security (CNAS) think tank. Despite the Trump administrationxe2x80x99s hardline policies towards Beijing, Ratner didnxe2x80x99t believe Trump was tough enough. In September 2020, he co-authored an op-ed titled xe2x80x9cTrump Has Been Weak on China, and Americans Have Paid the Price.xe2x80x9dFrom his post at CNAS, Ratner led a congressionally mandated study on China that was released in January 2020. The report outlined various ways the US could compete with Beijing in Asia, including military deterrence or a xe2x80x9ccombat-credible posture in the Indo-Pacific,xe2x80x9d as the study put it.February 11th 2021Biden has been vocal about his desire to \"confront China's economic abuses, counter its aggressive, coercive actions, push back on China's attack on human rights, intellectual property, and global governance.\" His National Security Advisor Jake Sullivan has restructured the National Security Council to prioritize countering China in the Indo-Pacific. His Secretary of State Tony Blinken, who furiously agreed with Trump's hawkish China policy, ripped Chinese officials over the treatment of Uighurs, Tibetans and Hong Kong in his very first call to Beijing after taking office. His Defense Department is sending war ships into the South China Sea.Biden is plainly governing as a China hawk, and is giving every indication that aggressions between the two powerful nations will only get more heated in the coming years. Yet sleazy Republicans like Ted Cruz and their brainwashed supporters will keep hurling accusations of Beijing sympathies at this administration.How do I know this will happen? Well besides the fact that it is happening already and has been in the works for months, I know it because it's what happened last time. Throughout his entire four years in office, Donald Trump was consistently hammered with accusations of secret Kremlin loyalty, even after the Mueller investigation failed to indict a single American for conspiring with the Russian government. These accusations did not harm Trump in any meaningful way, but they did in effect end up providing cover for him to escalate tensions against Russia more aggressively than any president since the fall of the Berlin Wall. During the 2012 presidential race, Barack Obama mocked Mitt Romney for saying that Russia was America's greatest geopolitical threat, saying \"The 1980s are now calling to ask for their foreign policy back, because the Cold War has been over for 20 years.\"Just imagine, for a moment, the reaction that American liberals would have had if they'd gone directly from that kind of narrative to the scary fascist orange man accelerating toward nuclear brinkmanship with the world's other leading nuclear weapons force. They would have freaked out about it catastrophically, because they hadn't yet been trained to hate Russia and demand increased aggressions against Moscow. Russiagate was first and foremost a mass scale psyop born of the US intelligence cartel and advancing the pre-planned agendas of the US intelligence cartel against a longtime geostrategic target.I said years ago that the ultimate target of Russiagate was not Trump or Russia but China, and we're seeing that playing out now. Moscow's increasingly close relationship with Beijing means it needs to be targeted and shoved off the world stage via economic warfare and other cold war maneuverings to weaken its ability to defend the real target China before its surging economic power can permanently end US unipolar hegemony in our world.We are watching a slow-motion third world war play out between the US-centralized power alliance and the nations which have resisted absorption into that alliance, and propaganda plays a vital role in manufacturing public consent for the various steps that need to be taken along the way to accomplish this. That is what we've been seeing with Democrats and manufactured Russia hysteria, and it's what we're seeing with Republicans and manufactured China hysteria as well.February 8th 2021If you can create a situation where the leader of one political faction is escalating aggressions against a targeted nation while the other political faction is constantly accusing him of loyalty to that same nation, you've successfully manipulated the public into actively cheering for as many world-threatening cold war escalations as you want. Not only that but you've prohibited the opposite faction from putting up any resistance to these dangerous actions because they're being politically pressured to demonstrate that they're not \"soft\" on the targeted nation, pressured to show that they are in fact far more hawkish toward that nation than their accusers are. Trump was successfully pressured to hit Russia with sanctions, menace it with an aggressive Nuclear Posture Review and troops on its border, bomb and starve its allies while tearing up crucial nuclear treaties, all while the Maddow muppets completely ignored these actions and kept insisting that Trump was acting the way you'd expect a secret Russian agent to act. The psyop worked perfectly. So why change the formula?Biden will continue to roll out aggressions against China while the rightist political/media class keeps churning out narratives that he is soft on China. Rank-and-file right wingers will be manipulated into clapping along by mass media propaganda and by internet psyops feeding them nonsense about Hunter Biden's laptop proving that his father is owned by the CCP. It won't look exactly the same as Russiagate because the subjects and demographics are not the same, but the end result will be: the escalation of the slow-motion third world war against the world's most powerful unabsorbed governments.This is such a perfect example of the way the Democratic and Republican Parties function like the jab-cross punch combination in boxing, each working together to set each other up for knockout blows. They don't look the same, and they aren't used in exactly the same ways, but they're both used in conjunction to advance the same goal: punching the rest of humanity in the face until it falls.__________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Cruz can whine about a \"soft\" China policy all he wants, but it won't get traction in corporate media except possibly OAN.  The media is too busy repeating that he's trying to have AOC killed and reporting on the impeachment circus.Hi Caitlin and thank you for publishing this piece!Regarding your prediction:\"the escalation of the slow-motion third world war against the world's most powerful unabsorbed governments\".How would this escalation(s) look like in the real world?No posts","title":"Biden Will Escalate Aggressions Against China While Republicans Call Him A BeijingÂ Puppet - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/biden-will-escalate-aggressions-against"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/biden-continues-trumps-war-on-the","id":"12","imgs":"https://cdn.substack.com/image/twitter_name/w_36/ggreenwald.jpg","readingtime":65,"text":"Just one day after a coalition of prominent civil rights groups made headlines with a letter urging the Biden administration to drop efforts to extradite WikiLeaks founder Julian Assange to the United States on espionage charges, the Biden administration has announced its intention to continue those efforts.\"Justice Department spokesman Marc Raimondi on Tuesday said the U.S. government will continue to challenge a British judgexe2x80x99s ruling last month that Assange should not be extradited to the United States because of the risk he would commit suicide,\" Reuters reports.xe2x80x9cWe continue to seek his extradition,xe2x80x9d Raimondi said.Reuters @ReutersFebruary 9th 2021Assange's arrest and subsequent charges under the Espionage Act in 2019 for what amount to standard journalistic practices which exposed US war crimes marked both a dramatic escalation in the US empire's war on critical national security journalism and a sharp divergence from the Obama administration's decision not to pursue such charges in this case. Biden is not just upholding Trump's assault on press freedoms (far and away the single most egregious attack on journalism in the 45th president's entire four years in office), he is rejecting the Obama administration's decision not to charge Assange due to concerns that it would erode the First Amendment. As The Washington Post reported during Barack Obama's second term in 2013:\"The Justice Department has all but concluded it will not bring charges against WikiLeaks founder Julian Assange for publishing classified documents because government lawyers said they could not do so without also prosecuting U.S. news organizations and journalists, according to U.S. officials.\"...xe2x80x9cThe problem the department has always had in investigating Julian Assange is there is no way to prosecute him for publishing information without the same theory being applied to journalists,xe2x80x9d said former Justice Department spokesman Matthew Miller. xe2x80x9cAnd if you are not going to prosecute journalists for publishing classified information, which the department is not, then there is no way to prosecute Assange.xe2x80x9dNothing about this has changed. The Trump administration did not have access to any evidence that the Obama administration did not also have in 2013, it just chose to squint at the law from a different angle and legally interpret Assange's journalistic activities as a violation of the Espionage Act. There is nothing whatsoever preventing other journalists around the world from facing the same fate under similarly dubious legal interpretations. The US Department of Justice is not going to be using other people's personal definitions of what constitutes legitimate journalistic activity going forward, it's going to be using its own.November 16th 2018Biden's divergence from the Obama administration's less authoritarian position on the matter should not come as much of a surprise, since he took an absurdly hard line against WikiLeaks after the first publications of the earth-shattering Manning leaks in 2010.\"I would argue it is closer to being a hi-tech terrorist than the Pentagon papers,\" Biden said of Assange at the time. \"But, look, this guy has done things that have damaged and put in jeopardy the lives and occupations of people in other parts of the world.\"It should also come as no surprise because, all things considered, this administration has not been much different from the previous one in terms of actual policy. The policy of regime change interventionism in Venezuela is the same. The policy of hawkishness toward China is the same. The policy of starvation sanctions against Iran is effectively the same. In a recent CNN interview Secretary of State Tony Blinken could not speak highly enough of Trump's more incendiary foreign policy decisions like moving the US embassy to Jerusalem and recognizing the illegally occupied Golan Heights as Israeli territory. There are far, far more similarities between the Trump administration and the Biden administration than there are differences. As is consistently the case with US presidents, the narratives are different, the campaign platforms are different, the political parties are different, but the actual policies and behaviors remain more or less the same.The Situation Room @CNNSitRoomFebruary 9th 2021None of this means we should stop fighting tooth and claw for Assange's freedom: the fight is far from over. There is still time for the Biden administration to opt against appealing the UK court decision not to extradite, thereby leaving the entire embarrassing extradition attempt on Trump's lap.\"The US may submit its Assange appeal filing by Friday to meet its deadline, but one would expect a serious policy decision to be made by the new Attorney General who, once confirmed, can review the incredibly weak case against Assange in full before making a determination,\" a statement by the Courage Foundation reads. \"Reports are circulating that an interim spokesperson says the Biden admin will continue the Assange case. The incoming DOJ, whose Attorney General is yet to be confirmed, can drop the charges against Assange at any time, including after this Fridayxe2x80x99s appeal deadline.\"So we keep pushing. We cannot allow a corrupt and murderous globe-spanning empire to effectively outlaw inconvenient journalism around the world in the way it would by setting the legal precedent it is trying to set with the Assange case. If journalists everywhere know they can be extradited and imprisoned for publishing inconvenient facts about the US-centralized empire, they will largely refrain from doing so. And that is the whole idea.Through WikiLeaks Julian Assange has revealed a lot of damning information about the most powerful entities on our planet, but by far the most damning revelation he provided was not a WikiLeaks release at all: it was the revelation that \"free democracies\" like the US and the UK will openly imprison and torture a journalist for telling the truth. This has been seen, and it cannot be unseen. We owe him a great debt for bringing such facts into the light. The least we can do is try to get him out of there now.______________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.This piece is tripe - not that I have come to expect anything less from Ms. Johnstone. Stealing government secret correspondence, spraying it all over the floor and telling people to knock themselves out to find government secrets is not journalism. In many ways, it is the opposite of journalism. Philip Graham said journalism is the first draft of history. This is the first shitstain of history. Contextless, insightless, and distracting those like Ms. Johnstone from seeing what the hell is actually going on. Julian Assange is not worth this kind of - well, I was going to say xe2x80x9cattentionxe2x80x9d but itxe2x80x99s actually hero worship not unlike what the right is doing with our orange former president.Another excellent and informative piece from Ms Johnstone. This situation presents the Left in the USA and UK with a dilemma: how do they reconcile their adoration of Joe Biden with this? I suspect that we'll see a lot less activism on Mr Assange's behalf than we did when it was so easy to blame the persecution on Trump. I hope I'm wrong and that Mr Assange is freed soon.No posts","title":"Biden Continues Trump's War On TheÂ Press - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/biden-continues-trumps-war-on-the"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/democrats-want-to-lose-the-midterms","id":"13","imgs":"https://cdn.substack.com/image/fetch/w_90,h_90,c_fill,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F7ddb5cf9-f1e7-4f70-bb79-a93767dab429_960x960.jpeg","readingtime":77,"text":"Americans: We're dying!Republicans: Good.Democrats: We hear you and we honor your experience.xe2x9dx96The USA is the single worst human rights offender on our planet. The fact that most of its transgressions take place outside its own borders makes it more egregious, not less. So-called human rights watchdog groups which fail to acknowledge this fact are propaganda constructs.xe2x9dx96By 2024 the only mainstream US political debate allowed will be about whether America should nuke Russia or China.xe2x9dx96xe2x80x9cKindly let me help you or you will drown, said the monkey putting the fish safely up a tree.\" ~ Alan WattsInterventionist foreign policy in a nutshell.xe2x9dx96War is insanity. Unjust war is criminal insanity. One of the ugliest things about western imperialism is the way it gives extremely young soldiers whose minds have been warped by a criminally insane war machine the power of life and death over defenseless populations.xe2x9dx96One very important thing you can do is keep finding new ways to help people see the horrors of imperialism with fresh eyes. It's all so aggressively normalized and it's been going on all our lives, so it's easy to get used to it and lose sight of how unspeakably horrific it is.xe2x9dx96Choosing to continue an immoral course of action is as immoral as initiating it. Presidents who continue the immoral policies of their predecessors are as culpable as the presidents who initiated them.xe2x9dx96The Democratic Party is corrupt and murderous beyond the possibility of redemption and anyone who says otherwise is either deceived or deceiving.xe2x9dx96I'm seeing US progressive/DSA types getting more and more agitated about the sudden increase in hostility toward the Democrats from the left. What did they think was going to happen when the Dems took control of the entire government? You're the power now, buttercup.xe2x9dx96The problem with warning that the $2000 check scandal will lead to losses in the midterms is that Democrats are fine with losing in the midterms. You think they like having to own all their right wing bullshit for themselves? Democrats hate being exposed and vulnerable like this. They much prefer to blame their corporate cronyism, austerity policies and warmongering on an obstructionist Republican congress. They're happy to lose the midterms. They prefer to lose the midterms.xe2x9dx96The easiest way to look cool is to fight the power. The easiest way to get rich is to serve the power. The easiest way to look cool and get rich is to serve power while appearing to fight it.xe2x9dx96Democrats are absolutely correct that it is of paramount importance for the Republicans be held accountable for their atrocious crimes lest those crimes repeat themselves in the future.Start with the Bush administration.xe2x9dx96Immense military and financial commitments are made to Israel on the grounds that it's \"the only democracy in the Middle East\", but also if you try holding it to the same standards as other democracies you're a Nazi.And also Israel is not a democracy. Obviously.xe2x9dx96If I saw someone criticizing the many, many horrible things the Australian government has done, it would never in a million years occur to me to rush to Australia's defense. Yet I interact with people hastening to defend the US empire on a daily basis. These people are silly.xe2x9dx96World peace and inner peace are not separate endeavors. Go deep enough into one and you'll eventually find yourself working on the other as well.xe2x9dx96If humanity can't collectively transcend egoic consciousness it won't matter if the revolution succeeds; even if we create worldwide utopia we'll only end up destroying it out of boredom. Conflicts with each other and with nature will keep rebirthing until inner conflicts vanish.__________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Those of us actually on the (radical) left really have no choice but to continually reveal the corrupt bloviating mendacity of the Dems and their minions, else we risk bring subsumed into that revolting matrix as \"the left\".  Thanks for being so clear about these charlatans.Alan Watts had great simple fixes for government like making politicians more like civil servants - not celebrities - who weren't motivated by wealth, fame and power to enrich themselves and the members of their elite community.No posts","title":"Democrats WANT To Lose The Midterms: Notes From The Edge Of The Narrative Matrix - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/democrats-want-to-lose-the-midterms"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/bidens-iran-policy-is-just-trumps","id":"14","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fd3f78d95-8dca-48fc-aa25-2982f5456a53_800x533.jpeg","readingtime":79,"text":"In a new interview with CBS Evening News, President Biden confirmed that his administration will not be lifting sanctions imposed upon Iran in order to bring Tehran to the negotiating table for the restoration of the Joint Comprehensive Plan of Action (JCPOA), commonly known as the Iran nuclear deal.\"Will the U.S. lift sanctions first in order to get Iran back to the negotiating table?xe2x80x9d Biden was asked by CBS's Norah O'Donnell.\"No,\" the president replied.\"They have to stop enriching uranium first,\" asked O'Donnell.Biden nodded in response.February 7th 2021There are a few things that are ridiculous about this, the first being that the JCPOA does not require that Iran \"stop enriching uranium\" at all. As explained by Al-Monitor's Arash Karami, the deal only calls for Iran to \"keep its level of uranium enrichment at up to 3.67 %\", a level it only began exceeding when the Trump administration backed out of the deal and imposed sanctions. The administration later clarified that Biden meant Iran would have to return to its JCPOA levels before negotiations could begin, but the fact that neither the United States president nor the high-profile reporter interviewing him appear to have been clear on this says a lot about the vapid nature of America's political/media class.More importantly, this is confirmation from the horse's mouth that Biden is in effect continuing Trump's Iran policy. Trump began strangling Iran with crushing sanctions in an effort to force it to obey US dictates, and Biden is continuing that exact same strangulation while continuing to demand compliance with its dictates. The demands might be a little different, but the effect is identical since Tehran would never bow to either of them.The Iranian government has repeatedly made it abundantly clear that it will not be rejoining the JCPOA until the United States comes back into compliance, since it was the US who first abandoned it. It claims, correctly, that it was in full compliance with the agreement when the Trump administration unilaterally backed out in May 2018. The argument that it is therefore Washington's responsibility to come back into compliance first is indisputable. Why would it re-enter a deal with a government that is clearly acting in bad faith and could just back out and impose civilian-killing sanctions on the nation again?January 26th 2021And that's just getting back to the negotiating table for re-entering the deal as it is written. Gareth Porter reported last month that the Biden administration may plan on using the sanctions regime it inherited from the previous presidency as a \"Trump card\" to try and coerce Tehran into agreeing to a modified version of the deal. Neither of these things are going to happen. Iran will not modify the deal, and it will not come back into compliance before the government which first abandoned the deal comes back into compliance. And the Biden administration appears to be perfectly fine with this, reportedly toying with the idea of waiting all the way until after Iran's presidential elections in June to even begin approaching the deal.The end result being that we still have a US presidency waging economic warfare upon Iran in exactly the same way it was before the 20th of January. Civilians are still having the life squeezed out of them by a far more powerful nation which does not view them as human beings, and it's only a matter of time before this administration or a subsequent one causes another flare up which pushes things to the brink of hot war like we saw a year ago.Biden's Iran policy is in effect just a continuation of Trump's Iran policy that liberals can feel good about. It's Trump's Iran policy with gender pronouns in its bio.February 7th 2021Choosing to continue an immoral course of action is just as immoral as choosing to initiate an immoral course of action. If you're beating someone up and you leave when I get there, and then I choose to continue assaulting that person, I am just as culpable in that assault as you are. Presidents who choose to perpetuate one another's depraved policies are just as guilty of that depravity as their predecessors.Starvation sanctions are the only type of warfare in which it is considered normal and acceptable to deliberately target a civilian population with deadly force. But it is not normal, and it is not acceptable. Biden and his team of ventriloquists fully own the effects of their warmongering. They don't get to just scribble \"TRUMP'S FAULT\" across them in crayon and act like they're innocent.The mainstream media are fixated on the differences between the Biden administration and the Trump administration, just as they were fixated on the differences between the Trump administration and the Obama administration four years ago. If you can mentally mute that vapid soundtrack and look at the similarities between administrations instead, regardless of party affiliation and campaign platforms, you'll learn a lot more about what's really going on in the world._________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Yes. The Iran situation has been fxe2x80x99ed up since 1954, or even before. But the ayatollahs are every bit as bad as the worst western politician. The people of Iran DO NOT want this theocracy clamping down on them any more than you would. Itxe2x80x99s easy to decamp to New Zealand or Oz or wherever you live and pontificate on the US or Iran or Iraq, but you donxe2x80x99t live there. You live in the safest place on earth. And yes, US Imperialism is really fucked. But given the present situation, what do you think the US should do? You criticize but you donxe2x80x99t offer any alternatives. What do you think happens when Iran has nukes? You think that has a happy ending?! Haven't we seen this before with the last administration Biden was involved with? Obama continued and expanded Bush's policies and the liberals cheered what they used to be protesting against.No posts","title":"Biden's Iran Policy Is Just Trump's Iran Policy With A Rainbow FlagÂ Emoji - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/bidens-iran-policy-is-just-trumps"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/electoral-politics-use-the-same-containment","id":"15","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F1abc24ee-5e53-4b36-b111-3675ea98f3ef_480x640.jpeg","readingtime":54,"text":"In a high-quality dementia care facility, confused residents who are at risk of unsafe wandering are skillfully redirected away from exit doors by staff members who are trained to provide them with the illusion of freedom while still keeping them in the safety of the care home. A propaganda-addled populace wandering around trying to find an escape from its oppressors is redirected in very much the same way.If you've ever visited a loved one in a locked dementia care facility, especially near sunset, you know how agitated the people who live there can become. The impulse to wander and pace is very common, and depending on where they're at cognitively they'll often demand to leave the facility at once so they can go \"home\".When this happens, unskillful staff members will take an openly authoritarian position and tell the resident that they cannot leave and that the facility is their home now. This confrontational approach invariably leads to agitation on the part of the confused resident, because in their mind they really do live somewhere else and are being told they need to remain locked in a strange place that they have no memory of. This can quickly lead to a catastrophic response that is unpleasant for everyone, especially the resident in question.A more skillful staff member will employ a very different strategy. Rather than engaging in futile attempts to persuade someone with severe dementia that they must stay and that their perception of reality is wrong, they will simply say \"Ah yes, right away Mister Smith! Let's go get you ready to leave.\" They'll take him by the hand, ask him if he wants dinner before he leaves, get him talking about his time in the army, distracting him from the thought of leaving and letting the memory loss do the work for them. In a few minutes Mister Smith is happily chowing down on mechanical soft meat and potatoes without a care in the world.The fancier facilities won't even have locked doors that are immediately noticeable, with (as weather and daylight permit) the doors left unlocked to a large, enclosed garden area full of circular walkways which eventually guide a wandering resident back indoors. The actual exit point of the facility is through a building on the far end of this large yard with a staff member at the front desk who can redirect any resident who happens to meander their way through the winding paths. This way staff don't even need to worry about a resident who decides they want to leave, they can just say \"Sure thing Mister Smith! Door's right there!\" knowing he'll just wander around for a bit and come back in.Anyway, that's how electoral politics works. The public will periodically become agitated at the way their wealth and resources are being stolen from them and spent on overseas wars, or the fact that they are deliberately kept poor and busy by a plutocratic system in which the relative wealth of the rich is given more political power by the relative poverty of everyone else, and they are redirected.They are not told \"No Mister Smith, you are the property of the oligarchic empire.\" They are instead told by the skillful manipulators of the political/media class, \"Ah yes Mister Smith, you can have everything you want! Just vote for the Democratic Party right over there!\"And just as the facility's design intended, Mister Smith goes out the door to the Democratic Party, wanders around in circles for a while, then comes back inside without posing any inconvenience to the staff members who run the empire.Meanwhile the actual exit from the abusive system is kept carefully hidden. A lot of dementia care facilities will disguise their exits by painting them to look like murals or bookshelves, like this:That's where fighting the propaganda machine is hidden. That's where direct action is hidden. That's where a critical mass of people waking up from the manipulations and using the power of their numbers to directly force real change is hidden. Cleverly disguised behind a bunch of gibberish about \"conspiracy theories\", \"Russian propaganda\" and \"extremism\", with a bunch of staff members pointing the way toward a false exit that cannot ever lead to our escape.Obviously care homes are a good and necessary thing for protecting victims of Alzheimer's disease and other forms of dementia who can't be kept safe at home, whereas the system in which we all find ourselves is unforgivably abusive and malignant to its core. But the psychological principles work in exactly the same way: it's much easier and far more energy efficient to give people the illusion of freedom than to tell them they are locked up against their will. If you let the people know you stand in opposition to their will, they're going to try to fight you, so it's best to pretend you're on their side and willing to give them everything they want.That's all electoral politics is. That's all the Democratic Party is. That's all we were seeing when Americans shook the earth with Black Lives Matter protests last year while the entire establishment told them \"I hear you, I agree with you\" without ever actually making any changes. It's a locked facility we are forbidden from leaving with a bunch of staff members pretending to want what we want.But the fact that the managers of empire go to such lengths to avoid a direct confrontation with us means that they desperately want to avoid that confrontation. We are not an elderly dementia patient, we are the many. They are the few. If we can ever collectively stop falling for the redirections to the circular pathways and stand and face our oppressors, they do not stand a chance. And they know it.They cannot arrest us all. They cannot kill us all. All they can do is keep us confused and distracted, and hope we don't remember our true power. That's all this is._________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Caitlin, I always look forward to reading your essays. I rarely disagree with your observations and analysis. Few journalists  ever cut through the horse hockey to get at the truth and tbe real source of our troubles.Your remedy for empire, however, puzzles me.  Not that I disgree with direct action, but I am wondering (and I may have missed this) would you mind describing more precisely what  effectual direct action looks like? To me the actions of black lives matter has not improved the lives of Africa- Americans. Token cultural change that makes the ruling class more colorful serves only to legitimize the same violent economic system that oppresses all ethnicities. What are the specific actions that can do otherwise? Thank you for your creativity and for using it to help people understand how they are lost and confused. Interestingly, those at the top of the global hierarchy also suffer from the same mental impairments: identification with mind contentxe2x80x94our personal inner narrative filtered through hundreds of cognitive biases. So we have all xe2x80x98forgottenxe2x80x99 who we really are. All of us who completely identify with the voice in our head named xe2x80x9cmexe2x80x9d are insane. Our cruel unjust world reflects our inner madness.No posts","title":"Electoral Politics Use The Same Containment Strategies As Alzheimer's Facilities - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/electoral-politics-use-the-same-containment"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/the-empire-must-die-notes-from-the","id":"16","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2Fe8525227-1969-459c-9980-1d92364c6c14_834x518.jpeg","readingtime":83,"text":"Q: What is a liberal?A: A liberal is a violent white supremacist extremist who supports and participates in the mass slaughter of brown-skinned human beings overseas while tweeting that white supremacist extremists are bad.xe2x9dx96Q: What is capitalism?A: Capitalism is a wonderful economic and political system which has given us powerful technology, a wide assortment of breakfast cereals, and near term human extinction.xe2x9dx96Q: What is China?A: China is a large Asiatic nation which westerners use as an emotional punching bag for their capitalism-induced rage, propaganda-induced confusion, and fears about the death of the US empire.xe2x9dx96Q: What is Israel?A: Israel is a US military operation that is used to justify continual western military expansionism in a crucial geostrategic region, with some civilians sprinkled on top for cover.xe2x9dx96Q: What is a \"tankie\"?A: Anyone to the left of you on foreign policy.xe2x9dx96Q: Who is the biggest leak source of CIA documents to the news media?A: The CIA.xe2x9dx96Q: What is the Republican Party?A: An organization which assures Americans of conservative sensibilities that the status quo is working fine.Q: What is the Democratic Party?A: An organization which assures Americans of liberal sensibilities that the status quo is working fine.xe2x9dx96Q: What's the difference between a prostitute and a mainstream media pundit?A: One gets paid handfuls of cash to do shameful and degrading things which tear apart the fabric of society, the other earns an honest living as a sex worker.xe2x9dx96You're allowed to choose between oligarchic warmongers who make you feel uncomfortable or oligarchic warmongers who make you feel comfortable. Those are your choices.xe2x9dx96The main difference between QAnon conspiracy theories and Russiagate conspiracy theories is that one makes people do dumb things like alienate their families and riot at government buildings while the other manufactures consent for cold war agendas that may end all life on earth.xe2x9dx96The difference between an anti-imperialist socialist and a Bernie Sanders progressive is far greater than the difference between a Bernie Sanders progressive and a Hillary Clinton liberal.xe2x9dx96The first thing an authoritarian power does to quash protests nowadays is always to cut the internet, because it kills dissidents' ability to organize and share information. Don't think the increasing normalization of internet censorship in the west is about anything else.xe2x9dx96I'm going to keep pointing this out until it catches on: Trump was targeted with accusations of subservience to Russia, hiding the fact that he was ramping up aggressions against Russia. Biden's being hit with accusations of loyalty to China, hiding his escalations against China.They're recycling the exact same script, and why wouldn't they? It worked. The public have been enthusiastically consenting to world-threatening cold war escalations which benefit them in no way, shape or form. It's a very effective psyop.This will continue. If you think Biden will be cuddly with Beijing, you are wrong. Please re-evaluate your worldview as the facts prove you wrong.xe2x9dx96Just as a body will fight to eject any pathogen which threatens its survival, an empire will fight to eject anyone who threatens its survival. Whenever you see a person or government targeted by the full might of the empire, that's what you're looking at.Like a shark, the empire must keep advancing or it will die. Any government or leader which stands in the way of its continual expansion around the globe is seen, correctly, as an existential threat. Not to the US as a nation, but to the empire which must keep advancing or die.This is why you'll never see a US politician actually slamming the brakes on imperialism. If anyone gets anywhere near a position where they might do so, they will be targeted and eliminated. It's the one door you're forbidden to go through, because it threatens an entire empire. They might let you advance a few mildly progressive domestic agendas, but they will never, ever let you anywhere near the possibility of ending western imperialism.In order to end the wars and move toward health, the empire will necessarily have to die. Not the United States as a nation, but the globe-spanning oligarchic power structure whose power, wealth and military might have been loosely centralized around Washington DC.And of course many of those who threaten the empire's survival won't be nice people; this isn't a Hollywood movie about Good Guys versus Bad Guys. But only the US-centralized empire is waging a nonstop war upon the world with the aim of perpetual unipolar planetary domination.Ending the empire won't solve all our world's problems. But because the empire can only survive on a steady diet of death and destruction, its death is a necessary first step toward creating a healthy, peaceful world.___________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.Um, according to https://www.godaddy.com/whois/results.aspx?checkAvail=1&domain=substack.com this is a sitting duck platform for take-down:WHOIS search resultsDomain Name: SUBSTACK.COMRegistry Domain ID: 1594580975_DOMAIN_COM-VRSNRegistrar WHOIS Server: whois.registrar.amazon.comRegistrar URL: http://registrar.amazon.comUpdated Date: 2020-12-14T18:21:22ZCreation Date: 2010-04-27T18:02:41ZRegistry Expiry Date: 2021-04-27T18:02:41ZRegistrar: Amazon Registrar, Inc.Registrar IANA ID: 468Registrar Abuse Contact Email: abuse@amazonaws.comRegistrar Abuse Contact Phone: +1.2067406200Domain Status: clientTransferProhibited https://icann.org/epp#clientTransferProhibitedName Server: ALI.NS.CLOUDFLARE.COMName Server: LEE.NS.CLOUDFLARE.COMDNSSEC: unsignedURL of the ICANN Whois Inaccuracy Complaint Form: https://www.icann.org/wicf/>>> Last update of whois database: 2021-02-07T01:23:27Z <<<For more information on Whois status codes, please visit https://icann.org/eppI'm generally with you, but I do question whether if the American empire dies, whatever comes next would be any more \"healthy\" and \"peaceful\". Not sure where there's any evidence of that based on other empires in history or competing empires currently. I'm also not sure you're right about China. I don't think they're necessarily the new Third Reich or anything, but does anyone else on Earth have a million ethnic minorities in concentration camps?No posts","title":"The Empire Must Die: Notes From The Edge Of The Narrative Matrix - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/the-empire-must-die-notes-from-the"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/youre-not-a-radical-youre-just-sane","id":"17","imgs":"https://cdn.substack.com/image/twitter_name/w_36/freedomrideblog.jpg","readingtime":13,"text":"In response to rumors that Bernie Sanders foreign policy advisor Matt Duss may be playing some role in the Joe Biden State Department, bloodthirsty psychopath Nikki Haley told the Washington Free Beacon that this \"is another indication that the only unity in Bidenxe2x80x99s foreign policy is between the far left and the extreme left.\"Which is of course ridiculous. Taken as a whole Biden's imperialist foreign policy has not differed much from Trump's, and Duss is a fairly reliable imperialist himself. This administration is not an \"extreme\" deviation from the norm, and much less a manifestation of anything that could be called \"extreme left\".February 4th 2021This nonsense comes out at the same time we learn that Secretary of Defense Lloyd Austin has put a bunch of US military operations on hold, not because those military operations are depraved acts of mass murder driven by the megalomaniacal agenda to dominate the entire world, but to hold \"needed discussions\" about the possibility that there may now be \"extremists\" among their ranks.\"Secretary of Defense Lloyd Austin has ordered a staggered pause of operations across the entire US military so commanders can have 'needed discussions' with service members about the issue of extremism over the next 60 days,\" CNN reports. \"The issue of extremism in the military has been at the forefront since the January 6 riot at the US Capitol. At least 22 people either formerly or currently associated with the military were charged in connection with the riot.\"That's right, the US military has for decades been merrily incinerating entire families, ripping apart children with cluster munitions, and destroying whole nations for disobeying US imperial dicates, but now they need to pause some of that normal, wholesome activity because a few bad apples might perhaps have succumbed to extremism.Devastating Iraq, turning Libya into a failed state, facilitating genocide in Yemen, waging an endlessly expanding 'war on terror' and brandishing armageddon weapons at your enemies? That's fine and normal. Members of the military joining hate groups and believing in QAnon? That's extremism.February 4th 2021This all just goes to show how completely meaningless the mainstream concepts of \"normal\" and \"extreme\" have become when talking about politics and power in our insane world. When you oppose the horror that is western imperialism people try to paint you as a radical extremist who can't just be reasonable and pragmatic about things, but really nothing could be further from the truth. There's nothing \"radical\" or \"extreme\" about opposing the domination of the entire planet with relentless acts of mass slaughter to the detriment of the world's most vulnerable populations, all because some sociopaths in DC decided that it is good and reasonable to inflict any amount of terror upon our world to preserve unipolar US hegemony. Opposing this is just basic human sanity.People will act like you're unreasonable and impossible if there's not a single US politician you support.\"Not even Bernie?\" they'll ask. \"Not even AOC?? What's wrong with you?!\"If you are an anti-imperialist, being asked to choose a US politician you support is like being asked to pick a favorite Nazi. The US empire is the single most evil and destructive power on our planet right now and everyone on Capitol Hill is an imperialist facilitator of mass murder, yet you'll be treated like an extremist moonbat if you don't like any of them. The problem isn't that an anti-imperialist has strange, impossible standards, it's that they oppose an insane and murderous status quo which only elevates leaders who will advance that status quo.February 5th 2021The same goes for socialism. There's nothing \"extreme\" or \"radical\" about believing the poor shouldn't be left to suffer and die and that workers should own the full value of their labor. It's not some crazy wingnut ideal to believe we should abandon the political and economic model of profit-chasing as the driving motivator for human behavior at mass scale which has driven our species to the brink of extinction. You're not an extremist if you oppose a system which crushes human beings to death at home and abroad for the power and profit of the very few, you're just normal.You're not a \"radical\", you're just sane. This is why I think it's important for sane people to reject such labels; there's a coolness factor which comes with presenting yourself as a radical, but it comes at the price of normalizing the status quo which is itself the epitome of violent extremism. Don't let that bat shit crazy model define you by setting the status quo up as \"normal\" and yourself as a \"radical\" deviation therefrom. They are the radical ones. You are just normal and sane.Abnormalize the status quo and normalize sanity. Put your energy into helping the world see how bat shit insane their \"normal\" really is. The status quo isn't the baseline of normality, sanity is. A sane, healthy world would look wildly different from this one, and we need to help people get clear on the distinction so we can all start creating that world together._________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.moonbat variant of the corona sweeping the world, extremely virulent, only hope a new vaxx or booster shot of corporate propagandaWay Upstream - with COVID Nineteen? https://wirralinittogether.blog/2021/02/05/way-upstream-with-covid-nineteen/No posts","title":"You're Not A Radical, You're Just Sane - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/youre-not-a-radical-youre-just-sane"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/youtube-financially-deplatforms-swath","id":"18","imgs":"https://cdn.substack.com/image/fetch/w_600,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fpbs.substack.com%2Fmedia%2FEtU6mIKXAAMsHbh.jpg","readingtime":69,"text":"The Google-owned video sharing platform YouTube has demonetized numerous independent media accounts, a jarring escalation in the steadily intensifying campaign against alternative news outlets online.Progressive commentators Graham Elwood, The Progressive Soapbox, The Convo Couch, Franc Analysis, Hannah Reloaded and Cyberdemon531 have all received notifications from YouTube that their videos are no longer permitted to earn money through the platform's various monetization features, as has Ford Fischer, a respected freelancer who films US political demonstrations. No explanation has been offered for this decision beyond the vague claim that \"your channel is not in line with our YouTube Partner Program policies\" due to \"harmful content\".February 3rd 2021Like all large online platforms, YouTube's appeals process is notoriously opaque and unaccountable. These accounts could remain demonetized for months, or forever, without any clear explanation at all. Ford Fischer, who has been in this situation before, said on Twitter that his account was left demonetized for seven months before YouTube reversed its decision.\"Last time you demonetized my channel, I spoke out for seven months. I didn't delete a single piece of content. You admitted you were wrong. I forgive you. Please don't do this again,\" Fischer tweeted.\"No superchats, no ad revenue, no YouTube premium money,\" tweeted Elwood, who also said \"I have a call with my lawyers later today.\"\"You guys have destroyed my channel without legit explanation as to why,\" tweeted Jamarl Thomas of Progressive Soapbox. \"No videos are given - and frankly there is literally zero 'harmful' content on my channel. This is a radically bad error that needs to be corrected.\"The Convo Couch's Jonathan Mayorca tweeted the notification he received from YouTube which gave the reason as \"Harmful content: Content that focuses on controversial issues and that is harmful to viewers,\" saying no specific video or subject was named. Nobody receiving these notifications appears to have any idea what is meant by \"harmful\" or \"controversial\" or why YouTube is mentioning them in the same breath as though these two things are connected or synonymous in some way.Graham Elwood @grahamelwoodFebruary 2nd 2021YouTube has been providing template responses saying \"We recommend making the needed changes to your content and reapply in 30 days\" while refusing to specify what the \"needed changes\" even are.Speaking for myself, I can say with absolute certainty that I would not be able to create content at anywhere near the pace I do were I not making enough money from it to do it full time. Life is far too demanding with far too much else going on for me to be able to maintain anything like daily output; being financially deplatformed and having to get another job would force me down to an essay a week in my spare time, if that. Anyone who works in independent media full time knows this, and so do the powerful people who are steadily ratcheting up the campaign to silence anyone who hasn't passed through the gatekeepers of the plutocratic media.Financial deplatforming is censorship. People were given an opportunity to devote themselves to the vocation of creating media outside the gatekeeping apparatus of billionaire news institutions, which is arguably the single most important vocation anyone can give themselves to in our world right now, and they built their lives around their ability to do this. Now it's being ripped away from them; their literal jobs are being taken away. They were offered a reason to think they'd be able to make a living doing very important work, and then they were sucker punched with what amounts to political censorship.This has been a continually escalating trend for years. The general population is herded onto huge monopolistic social media platforms offering democratization of information where your voice can be heard, and then those platforms proceed to censor an increasing amount of political speech in increasing coordination with the US government. February 3rd 2021If the democratization of information online is successfully reversed and the mass media gatekeepers are again the sole authorities on what's real and true, people will be locked into forming their ideas on how to think, act and vote based on what they are told by the same plutocratic media institutions which have been deceiving them into every war and manipulating them into accepting the status quo for generations.If the door is locked to the possibility of a grassroots information rebellion against the narrative hegemony of our rulers, we will remain doomed to continue along the same ecocidal, omnicidal trajectory these bastards have us on until it reaches its inevitable conclusion. This must be resisted.__________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.We're living in a Kafkaesque nightmare, where you're accused of a crime but not told what it is, with no chance to defend yourself. I feel for anyone who's built their livelihood on these platforms, but on the other hand, the writing was on the wall once Alex Jones was purged. He was the canary in the coalmine. A few short years later, the president himself is silenced, and people in the mainstream media are talking out loud about shutting down Fox News and creating a \"reality czar\" (a.k.a. a real-life Ministry of Truth). None of this is going to end well.Now that leftists are being demonetized and silenced, maybe we'll stop hearing so many people make the disingenuous argument that private companies can do whatever they want. When corporate monopolies with a stranglehold on the public square manipulate who can speak, they're altering the public discourse. They should no more be able to do what they're doing than the phone company should be able to cancel you because they don't like what you said on your last phone call. Something has to be done.demanding youtube or any silly-cons for anything is just a performative waste of time and energy.  1) find new and more ways to spread exactly what the ghouls want to suppress, 2) for boycott purposes, make and share lists of the advertisers on youtube and any other silly-con platforms, 3) make advertisements very very very expensive without return.  let's see who kneels first. No posts","title":"YouTube Financially Deplatforms Swath Of Indie MediaÂ Accounts - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/youtube-financially-deplatforms-swath"}
{"aud":"expert","category":"substack","description":"https://caitlinjohnstone.substack.com/p/the-lesson-of-the-blm-protests-notes","id":"19","imgs":"https://cdn.substack.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fbucketeer-e05bbc84-baa3-437e-9518-adb32be77984.s3.amazonaws.com%2Fpublic%2Fimages%2F3bb8bf2e-9b64-432d-9c06-4338f1b667f9_514x239.png","readingtime":59,"text":"Remember when Americans shook the earth with massive protests demanding an end to the police state and the entire liberal establishment just kept saying \"I hear you, I agree with you\" and then did absolutely nothing to even reduce police brutality? It's important to remember such lessons.People would ask me \"Why are you supporting Black Lives Matter Caitlin?? Don't you see all the corporations and corporate Dems support it? Why would they do that if it didn't serve them?\" This is why they did it. Empty words of support can defuse a situation far easier than open opposition.Imagine if all the plutocrats, pundits and politicians had just yelled at the BLM protesters and admonished them to stop? It would have only turned people against them with far more aggression, and it would have exposed the fact that they are the enemy. It's much more effective to say \"I hear you, I agree with you\" with no intention of taking any real action.And really this is all institutions like the Democratic Party exist to do: defuse left populism and crush grassroots activism not with opposition, but with empty words of agreement that have no intention of action behind them. They're just a bottomless pit that tricks people into pouring their energy into it, thereby stopping all leftward movement.A kid who doesn't want to clean their room will tell their parents \"No! I don't wanna!\" A very clever kid who doesn't want to clean their room will say \"Yes! I'll get on that right away\" and then enjoy hours of peace and relaxation without parental nagging, and without cleaning. It's the exact same way with the powerful. It's much more efficacious for them to pretend to be on your side than expose the fact that they're not. In the end the result is the same: the kid doesn't clean their room. But they don't get the kind of pushback they'd get if they said no.Manipulators are good at manipulation. The people who make their way to the top in a corrupt system are manipulators. You can't take their words at face value, mustn't mistake vapid placation for victory. They'll happily give you a mountain of words in exchange for your real treasure.xe2x9dx96They're so used to manipulating Americans into believing narratives that wildly differ from reality they were like \"We'll tell them $1400 is $2000, they won't notice.\"xe2x9dx96The world would be greatly improved if Americans became far more powerful and their government/military/media became far less powerful.xe2x9dx96Yemen alone, just by itself, is a sufficient argument for the dismantling of the entire US-centralized power alliance.xe2x9dx96To be clear, Yemen isn't some tragedy that we are passively witnessing. Civilians are being deliberately targeted and starved with the backing of the US, UK, Australia, Canada and France. Our governments are helping to inflict this horror upon innocents. And it may get worse.xe2x9dx96A world order which can create something as horrific as the atrocities in Yemen or the unforgivable Iraq invasion is not a world order that will lead the world in a good direction. The facts are in. The US-led world order must end.xe2x9dx96\"You hate all US politicians Caitlin! You can't name a single one you like!\"That's like wanting me to pick a favorite Nazi leader. It's a system which only elevates assholes who will cooperate with a machine that is fueled by human blood. You just don't see how ugly it is yet.xe2x9dx96Anti-imperialism makes you look like a radical, because it makes you reject even the politicians who are considered \"radical\" in mainstream discourse since they are all imperialists. In reality there's nothing radical about opposing the mass slaughter of innocents; it's just being a normal human being. Basic human sanity is often painted as \"radical\" because most people have no understanding of how bat shit insane our current world order is.xe2x9dx96The surest way to get rich in media is to spread lies which serve the interests of the powerful. The surest way to get labeled a \"grifter\" is to do literally the exact opposite of this.xe2x9dx96It's not enough to reject mainstream politics, we need to reject mainstream culture as well. The propagandists understand that politics is downstream from culture, so we should too. The culture manufacturers in New York and LA are not your friend; they are an extension of the empire.We who oppose the empire must reject its manufactured culture with the same disgust with which we reject its political lackeys and news media. We must create our own culture to outshine the manufactured garbage they are shoving down everyone's throats.xe2x9dx96If you want normal people to listen to an idea, you've got to make it easy to understand and you've got to make it interesting. No normal human being going about their life has any incentive to listen to you unless you do both of these things. The onus isn't on them, it's on you.Telling people to read theory doesn't work. How narcissistic would you have to be to think you can just tell some stranger to read Marx or Lenin or whatever and they'll go \"Well that complete rando ordered me to invest my scarce time and energy in this so I'd better do it\"? No. This is our job.Whenever I bring this up people say stuff like \"It's not a popularity contest Caitlin\". Yes it fucking is! You want your ideas to be more popular than the shitty, self-destructive, soul-crushing, world-destroying ideas which support the status quo. This won't happen by itself.It's not enough to be right. You can't save the world just by holding the right beliefs in your obscure corner of the information ecosystem. That's like believing life will reward you if you're a nice person on the inside. Share the ideas. Make them simple, make them interesting.xe2x9dx96One of the many advantages manipulators have over sincere people is that sincere people have no idea how very, very much better at manipulation a manipulator is than them, in the same way a chess newbie has no understanding of how many skill levels they are below a chess master.This is why it's so important for us to have the humility to know that we can be manipulated, and that we can be manipulated in ways we hadn't even thought of. Ways we wouldn't think of in a million years, because we are not that sort of creature.xe2x9dx96When you're in an abusive relationship, leaving seems impossible. After you escape, you look back and see that most of the barriers to leaving which felt so real at the time were illusory mental constructs. Escaping our abusive relationship with our oppressors will be like that.Freeing ourselves and creating a healthy world is not impossible. There are no solid walls preventing us from leaving the abusive relationship. The door's not even locked. The only thing holding us in place is mental manipulation via mass media propaganda. It's all in our head.______________________________Thanks for reading! The best way to get around the internet censors and make sure you see the stuff I publish is to subscribe to the mailing list for at my website or on Substack, which will get you an email notification for everything I publish. My work is entirely reader-supported, so if you enjoyed this piece please consider sharing it around, liking me on Facebook, following my antics on Twitter, or throwing some money into my tip jar on Patreon or Paypal. If you want to read more you can buy my new book Poems For Rebels (you can also download a PDF for five bucks) or my old book Woke: A Field Guide for Utopia Preppers. For more info on who I am, where I stand, and what Ixe2x80x99m trying to do with this platform, click here. Everyone, racist platforms excluded, has my permission to republish, use or translate any part of this work (or anything else Ixe2x80x99ve written) in any way they like free of charge.Bitcoin donations:1Ac7PCQXoQoLA9Sh8fhAgiU3PHA2EX5Zm2For your security, we need to re-authenticate you.Click the link we sent to , or click here to log in.\"It's not enough to reject mainstream politics, we need to reject mainstream culture as well. \"Here are your real revolutionaries, Caitlin.  By seeking local self-sufficiency, they are defunding the industrial system that destroys our planet and eliminating the surplus economic production that funds imperialism, domestic surveillance and foreign expropriation and adventurism. https://www.the-sun.com/news/1074573/collapsologists-civilisation-crumbles-coronavirus-preppers-prepared/Tulsi, Ron Paul....    Good people everywhereNo posts","title":"The Lesson Of The BLM Protests: Notes From The Edge Of The Narrative Matrix - Caitlinâs Newsletter","url":"https://caitlinjohnstone.substack.com/p/the-lesson-of-the-blm-protests-notes"}